[
{"abstract":"Shipping contributes roughly 2.8 % of global anthropogenic greenhouse gas (GHG) emissions, and this is projected to increase in the decades to come. The main regulator of the shipping industry, the International Maritime Organization (IMO), bears the responsibility for developing climate change regulation. Yet the IMO decarbonisation target remains only a 50 % reduction by 2050, and, while regulatory measures have been adopted, these mostly focus on increasing the energy efficiency of ships, not the reduction of total sector GHG emissions. The result is that carbon emissions from shipping continue to rise and are projected to increase by anything up to 50 % by 2050. While many studies are undertaken on the impact of efficiency regulations or the potential for market-based mechanisms, we argue in this piece that missing from this discussion is the potential for a target of full decarbonisation, in line with the IPCC recommendation, allied with a complete ban on the use of fossil fuels in shipping by 2050. This policy would provide certainty to the market and allow industry actors to undertake the transition in a level playing field. Without such a clear signal, carriers and shipowners will transition much more slowly to alternative fuels alongside continued long-term use of fossil fuels. We argue that this position should be actively considered and evaluated, with a tapered timeline to phase out the use of fossil fuels by this date. Instead of focusing research only on the marginal gains of partial policies, scholars and policymakers should prepare plans and evaluate scenarios linked to a clear goal of real zero by 2050.","themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"We analyze several scenarios of transport reforms for the city of Bordeaux (France) using a model that takes into account the interaction between transport and the housing market. We find that road pricing schemes are significantly more effective when they are accompanied by an increase in housing supply in locations where demand increases. This allows households to consider their options for relocation in the medium and long term. Our analysis is based on an aggregate model with a nested decision structure that includes both transport and housing. We provide a full description of the model structure and the calibration steps and make the source code available for those who wish to analyze other cases." ,"themes": ["Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"Cooperative intelligent transportation systems are now being widely investigated along with the emergence of vehicular communication. Services such as collective perception require a robust communication system with high throughput and reliability. However, a single communication technology is unlikely to support the required throughput, especially under mobility and coverage constraints. Thus, we propose in this paper a hybrid vehicular communication architecture that leverages multiple Radio Access Technologies (RATs) to enhance the communication throughput. We developed a Deep Reinforcement Learning (DRL) algorithm to select the optimal hybrid transmission strategy according to the channel quality parameters. We assess the effectiveness of our hybrid transmission strategy by a simulation scenario that shows about 20% throughput enhancement and a 10% reduction of channel busy ratio." ,"themes": ["Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"Nowadays, in several domains, data can be available from a multitude of sources using many models. Because of their heterogeneity, it is difficult to retrieve, combine and exploit this information. We present in this paper a Web interface for exploiting spatio-temporal heterogeneous data. The system is based on semantic data integration process using a materialization approach. A mechanism is proposed to enriched the knowledge base with spatio-temporal rules and experts knowledge. The system can be applied for various scenarios, and we illustrate this with two of our projects." ,"themes": ["Base et Traitement de données, IA"]},
{"abstract":"Vehicle density and channel utilization can vary significantly over short time intervals in complex and dynamic environments such as vehicular networks. In such situations, the European ITS-G5 technology proposed Decentralized Congestion Control (DCC) techniques, such as the reactive Transmit Rate Control (TRC) and the adaptive Dual α algorithms, to prevent performance degradation. This paper proposes a proactive DCC technique that uses a Recurrent Neural Network (RNN), namely the Long Short-Term Memory (LSTM), to optimize the channel performance. We specifically use smoothed Channel Busy Ratio (CBR) forecasting time series calculated using an LSTM agent and provided as inputs to DCC algorithms to achieve faster channel load convergence and, as a result, improve network stability, channel load limitation, and resource allocation fairness. According to the simulation results, the proposed proactive DCC algorithms outperform existing algorithms in terms of reduction in average channel load and faster channel convergence." ,"themes": ["Communications, Infrastructures et Connectivité"]},
{"abstract":"Secure-channel establishment allows two endpoints to communicate confidentially and authentically. Since they hide all data sent across them, good or bad, secure channels are often subject to mass surveillance in the name of (inter)national security. Some protocols are constructed to allow easy data interception . Others are designed to preserve data privacy and are either subverted or prohibited to use without trapdoors. We introduce LIKE, a primitive that provides secure-channel establishment with an exceptional, session-specific opening mechanism. Designed for mobile communications, where an operator forwards messages between the endpoints, it can also be used in other settings. LIKE allows Alice and Bob to establish a secure channel with respect to n authorities. If the authorities all agree on the need for interception, they can ensure that the session key is retrieved. As long as at least one honest authority prohibits interception, the key remains secure; moreover LIKE is versatile with respect to who learns the key. Furthermore, we guarantee non-frameability: nobody can falsely incriminate a user of taking part in a conversation; and honest-operator: if the operator accepts a transcript as valid, then the key retrieved by the authorities is the key that Alice and Bob should compute. Experimental results show that our protocol can be efficiently implemented." ,"themes": ["Communications, Infrastructures et Connectivité", "Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Emerging V2X applications, like Advanced Driver Assistance Systems (ADASs) and Connected Autonomous Driving (CAD) require Ultra-Reliable Low Latency Communications (URLLC). Unfortunately, none of the existing V2X communication technologies, such as ETSI ITS-G5 or C-V2X (Cellular V2X including 5G NR), can satisfy these requirements independently. In this paper, we propose a scalable hybrid vehicular communication architecture that leverages the performance of multiple Radio Access Technologies (RATs). To this purpose, we propose a novel ITS station protocol stack and a decentralized RAT selection strategy that uses Deep Reinforcement Learning (DRL). The proposed approach employs a double deep Q-learning (DDQN) algorithm that allows each vehicle to determine the optimal RAT combination to meet the specific needs of the V2X application while limiting resource consumption and channel load. Furthermore, we assess the ability of our architecture to offer reliable and high throughput communication in two different scenarios with varying traffic flow densities. Numerical results reveal that the hybrid vehicular communication architecture has the potential to enhance the packet reception rate (PRR) by up to 30% compared to both the static RAT selection strategy and the multi-criteria decision-making (MCDM) selection algorithm. Additionally, the selection strategy exhibits about a 20% improvement in throughput and a 10% reduction in the channel busy ratio (CBR)." ,"themes": ["Communications, Infrastructures et Connectivité"]},
{"abstract":"Combinations of passive and active flow control are used to reduce the aerodynamic drag of a three-dimensional blunt body by manipulating its large-scale wake asymmetries. An Ahmed-like body with a square-back is mounted in ground proximity in the test section of a wind tunnel to produce a canonical turbulent wake at ReH=5×105 based on the height H of the body. By using passive perturbations around the model, the large-scale asymmetry and dynamics of the unforced recirculation region are modified. Depending on the unforced wake equilibrium, additional high-frequency pulsed blowing, coupled with small curved deflecting surfaces along selected edges of the base, produces a very different impact on the drag. On the one hand, forcing the wake along all edges results in important drag reduction of up to 12 % through a wake-shaping mechanism with weak influence on the large-scale asymmetry. On the other hand, the reorganization of the recirculation region equilibrium plays a key role in the observed drag changes when the wake is only forced along some edges of the base. In particular, the symmetrization of the mean wake and the influence of forcing on the interaction mechanism between facing shear layers described by Haffner et al. (J. Fluid Mech., vol. 894, 2020, A14) appears to be one of the main mechanisms involved in drag reduction. Even if asymmetric forcing strategies resulting in symmetrization of the mean wake provide more modest drag reductions of up to 7 % compared with forcing around the whole base, they are more efficient from an energetic point of view. This study provides key ingredients to adapt forcing strategies for drag reduction in the presence of various wake asymmetries typically imposed in real flow conditions around ground vehicles." ,"themes": ["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Departure time choice is a key component of travel behavior that directly influences the spatial and temporal distribution of travel demand. This paper tries to develop a modeling framework for choosing the departure time that minimizes travel costs. In this regard, a modeling framework for generating departure time recommendations is proposed and applied to real commuting trips. The methodology is an extension of the departure time choice model with unreliable travel time. Two cases are considered. The first calculates the optimal time of departure when the mean of the travel time varies by time of day but the variance is constant. An exact solution to the departure time choice problem is provided for this case. In the second case, both the mean and variance vary with the time of day. A numerical solution is proposed; it is proved that the sequence of the numerical solution is contractive with a unique fixed point obtainable for any initial guess. We apply both to the departure time planning problem for a transportation operator that offers repetitive mandatory trips on a dense network. The case study offers two insights into departure time choice analyses. First, the assumption that the travel time variance at peak hours is constant induces biases for the optimal departure time. However, this assumption provides plausible results for the off-peak period. Second, travelers relying on personal judgment may have significantly different costs of travel than passengers making their decisions based on the system's recommendations." ,"themes": ["Géographie, Territoires et Sociologie"]},
{"abstract":"In recent years, cities are experiencing a deep negative impact due to traffic congestion. As the number of vehicles is increasing rapidly, traffic congestion becomes unsustainable in urban domains specially in peak hours leading to time and fuel waste, accidents, additional costs for the economy, environmental problems and consequently impaired quality of life. Tremendous effort is done to provide solutions dealing with traffic congestion detection and monitoring. Based on used technologies, existing solutions can be classified into three categories: sensor technology, Vehicular Adhoc Networks and visual traffic surveillance. In this survey, we review the main recent works proposed in each category and discuss their strengths and weaknesses. We give an insight of future directions for handling congestion using the presented methods. " ,"themes": ["Communications, Infrastructures et Connectivité"]},
{"abstract":"Cooperative Intelligent Transportation Systems (C-ITS) are being developed to enable information exchange among vehicles and between vehicles and the roadside infrastructure. C-ITS are regarded as a base technology to reduce road accidents and improve traffic efficiency sustainably. Driving in unsignalized intersections is a significant problem for drivers due to many accidents registered on such roads. In this paper, we aim to solve this problem by proposing an Intersection Assistance System (IAS) that helps C-ITS drivers crossing the intersection more safely. Our solution, namely ESIAS (Edge-based Safety Intersection Assistance System), uses an edge-computing architecture to process efficiently the data offloaded by sensors (cameras/lidars) installed on road intersections. Our solution's performance is evaluated through different simulation scenarios by calculating the number of avoided accidents in each scenario. The results show that ESIAS can effectively reduce 80% of potential accidents." ,"themes": ["Communications, Infrastructures et Connectivité","Capteurs et Traitement du signal"]},
{"abstract":"Distance-bounding protocols have been introduced to thwart relay attacks against contactless authentication protocols. In this context, veri-fiers have to authenticate the credentials of untrusted provers. Unfortunately , these protocols are themselves subject to complex threats such as terrorist-fraud attacks, in which a malicious prover helps an accomplice to authenticate. Provably guaranteeing the resistance of distance-bounding protocols to these attacks is a complex task. The classical countermeasures usually assume that rational provers want to protect their long-term authentication credentials, even with respect to their accomplices. Thus, terrorist-fraud resistant protocols generally rely on artificial extraction mechanisms, ensuring that an accomplice can retrieve the credential of his partnering prover. In this paper, we propose a novel approach to obtain provable terrorist-fraud resistant protocols without assuming that provers have any long-term secret key. Instead, the attacker simply has to replay the information that he has received from his accomplice. Based on this, we present a generic construction for provably secure distance-bounding protocols, and give three instances: (1) an efficient symmetric-key protocol, (2) a public-key protocol protecting the identities of the provers against external eavesdroppers, and finally (3) a fully anonymous protocol protecting the identities of the provers even against malicious verifiers trying to profile them. " ,"themes": ["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes","Communications, Infrastructures et Connectivité"]},
{"abstract":"The electrochemical and structural properties of a series of three different Na3V2(PO4)2F3 samples (with or without carbon coatings of different natures) obtained via different synthesis methods are compared through operando high resolution synchrotron X-Ray diffraction. The pristine materials all possess negligible quantities of oxygen defects, as probed by the b/a lattice parameters ratios and solid state NMR. Operando X-ray diffraction recorded during charge at C/2 reveal subtle differences between the samples (of different particle size, morphology and carbon-coating nature) in the crystallinity of the intermediate compositions formed within the Na3V2(PO4)2F3 - NaV2(PO4)2F3 phase diagram. A new temperature-controlled operando cell allowed to determine this phase diagram at 0°C, mostly unchanged compared to that of recorded at 25°C. Very high charging and discharging rates are demonstrated and intermediate compositions could be spotted operando even up to 25 C rate at which the compositional phase diagram is only slightly altered compared to that recorded under equilibrium conditions. Optimized carbon-coated Na3V2(PO4)2F3 shows exceptional rate and electrochemical cycling capabilities, as demonstrated by 18650 hard- carbon // Na3V2(PO4)2F3 prototypes of 75 Wh/kg that could be charged-discharged 4000 times at 1C rate.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Micro-mobility refers to a variety of small and lightweight vehicles designed for individual use. These new vehicles are inexpensive, simple to operate, and enjoyable to ride, making them the easiest and most suitable mode of transportation for trips of less than five miles. They have become extremely popular, especially with the advent of free-floating systems that offer users flexible parking in order to facilitate the rental process. However, the problem of imbalance and maldistribution is among the major challenges of these systems, causing dissatisfaction and loss of customers. Therefore, to ensure the balancing of the fleet and to make the best decision for its reorganization, we must consider strategic locations that are accessible to all. In this paper, we propose a machine learning model for spatio-temporal demand forecasting using a multi-output regression technique. The main goal of the paper is to help pick the ideal areas for fleet deployment and balance the system according to user needs. Our solution, designed for public electric scooters, is based on the estimation of user demand over a grid-based service area. In addition, we propose an enhanced solution that outperforms other baseline models, including the Random Forest, Gradient Boosting, and Stacking Regressor.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité", "Base et Traitement de données, IA"]},
{"abstract":"Modern-day mobile communications allow users to connect from any place, at any time. However, this ubiquitous access comes at the expense of their privacy. Currently, the operators providing mobile service to users learn call- and SMS-metadata, and even the contents of those exchanges. A main reason behind this is the Lawful-Interception (LI) requirement, by which serving networks must provide this (meta-)data to authorities, given a warrant. At ESORICS 2021, Arfaoui et al. pioneered a primitive called Lawful-Interception Key-Exchange, which achieves the best of both worlds: (provably) privacy-enhanced communications, and fine-grained fine-grained, limited access to user data. Their work had two important shortcomings. First, their protocol required pairings which, while sufficiently efficient, might not always be available in the mobile setting. More importantly, that scheme was only applicable in a domestic setting, where the concerned users (Alice and Bob) were subject to the same LI authorities. The case of roaming was left as an open question. In this paper we answer that open question. We extend the framework of Arfaoui et al. to allow Alice and Bob (now subject to potentially two sets of authorities) to establish a secure channel that guarantees the strong properties afforded by the LIKE schemes of ESORICS 2021. Our construction is pairing-free, faster than that of Arfaoui et al., and its security relies on standard assumptions.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes", "Communications, Infrastructures et Connectivité"]},
{"abstract":"A distributed system is a set of logical or physical units capable of performing calculations and communicating with each other. Nowadays, these systems are at the heart of technologies such as the Internet of Things IoT, the Internet of Vehicles IoV, etc. These systems collect data, perform calculations and make decisions. On the other hand, deep learning (DL) has led to enormous progress in the field of artificial intelligence. Since the precision of DL to form a set of reference data on a single machine is known, it becomes more interesting to form several models and distribute the intelligence over the different nodes of the system by different calculation strategies. In this paper we propose a method using deep neural networks on several machines by distributing the dataset before starting the training, ensuring communication between them in order to improve the calculation time and accuracy.", "themes":["Capteurs et Traitement du signal", "Base et Traitement de données, IA"]},
{"abstract":"After the deployment of a Wireless Sensor Network (WSN), we may need to update or even change the algorithm running in the sensors. WSNs are often deployed on a large scale which makes the manual update of the running algorithms impractical. Moreover, for some WSNs, sensors are physically inaccessible like sensors deployed in harsh environments making the manual update impossible. For these situations, wireless reprogramming is a suitable solution. In this paper, we deal with wireless reprogramming for WSNs using a high-level reconfiguration approach. Our approach is based on a theoretical model which is the Graph Relabelling System (GRS). Thereby, any algorithm designed with GRS models will be reconfigurable. We illustrate the proposed approach through a reconfiguration example changing the running algorithm from fire detection to way detection algorithm. We present the simulations realised with the CupCarbon simulator to validate the reconfiguration approach.", "themes":["Capteurs et Traitement du signal"]},
{"abstract":"Highly Resonant Power Transfer (HRPT) technology is currently receiving very significant attention from the industry and the smart power grid distribution community in particular. This technology ensures electrical power transmission between two points while controlling the level of transmitted power and ensures the immediate shutdown of the transmitted power in the event of a problem. This paper reviews the inductive power transfer method and describes the design of an ultra-compact PLA core electromagnetic coupler. The proposed architecture confines the magnetic field in a toroidal PLA core transformer, and by avoiding the use of heavy and bulky shielding plates, reduces magnetic losses and avoids the Curie point. As a result, the overall unit has a weight of 5 kg and a volume of only 0.013 m3. The electromagnetic coupler is capable of transferring a peak power of 150 kW with an operating frequency of 193 kHz, giving a satisfactory efficiency of 95%. The proposed novel system was first investigated through CST 3D numerical modelling to determine the electrical parameters of the coupler’s equivalent circuit and its efficiency, to verify its compatibility with the ICNIRP 2010 standard and to evaluate its temperature rise with an air-cooling system. Afterwards, the designed coupler was built with a 3D printing device and finally tested experimentally. Simulation and experimental results are compared and show a good agreement.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Truck platooning consists of one or several trucks driving very closely behind the platoon leader with the help of technology. Platooning reduces fuel consumption, carbon emissions and congestion while increasing road safety and the productivity of trucks and drivers. This article focuses on the advance planning of platoons. First, we study platoon formation from a system-wide optimization perspective. We formalize the underlying optimization problem and we propose exact and approximate solution approaches that appear to perform very well in instances of practical size. Second, we posit that truck platooning is much more likely to develop efficiently among multiple operators. This involves a shift in business relations between freight operators through cost sharing. We make use of cooperative game theory to study cost allocations among players. Our analysis shows that a compromise is needed among existence, stability and computational efficiency. However, we propose cost allocation rules for cooperative platooning games that perform very well in practice with regard to their stability. Finally, we propose an illustrative example based on the settings of the Port of Rotterdam and we provide a series of insights.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Recent advancements in autonomous vehicle perception haveexposed limitations of onboard sensors such as radar, lidar, and cameras, which road obstacles and adverse weather conditions can impede. Connected and Autonomous Vehicles (CAVs) are leveraging wireless communications to share perception information through a process called Cooperative Perception (CP), aiming to provide a more comprehensive understanding of their environment. However, this can result in excessive redundant and useless information in the network, as the same road objects may be detected and exchanged simultaneously by multiple CAVs. This not only consumes more network resources but also may overload the communication channel, reducing the delivery of perception information to CAVs and ultimately decreasing the overall CP awareness in the network. This paper introduces MCORM, a multi-agent learning method based on the advantage actor-critic algorithm to maximize object usefulness and reduce redundancy in the network. Our evaluations demonstrate that through this method, CAVs learn optimal CP message content selection policies that maximize usefulness. Further more, our proposal proves to be more effective in mitigating object redundancy and improving network reliability in comparison to existing approaches.", "themes":["Communications, Infrastructures et Connectivité","Base et Traitement de données, IA"]},
{"abstract":"This article studies the distribution problem of brick-and-mortar retailers aiming to integrate the online channel into their operations. The article presents an integrated modeling approach addressing the online channel-driven distribution network deployment (e-DND) problem under uncertainty. The e-DND involves decisions on operating fulfillment platforms and on assigning a fulfillment mission to those platforms, while anticipating the revenues and costs induced by order fulfillment, replenishment, delivery, and inventory holding. To model this problem while taking into account the uncertain nature of multi-item online orders, store sales, and capacities, a two-stage stochastic program with mixed-integer recourse is developed. Two alternative deployment strategies, characterized by allocation of orders, inventory positioning, delivery schema, and inbound flow pattern decisions, are investigated using this model. The first deployment strategy investigates the ship-from stores practice where the on-hand inventory is used for all sales channels. The second deployment strategy additionally considers the advanced positioning of inventory at a fulfillment center in the urban area where the online orders are requested. To solve the two-stage stochastic model with integer recourse, an exact solution approach combining scenario sampling and the integer L-shaped method is proposed. Numerical results, inspired by the case of a European retailer, are provided to evaluate the performance of the deployment strategies and the efficiency of the proposed solution approach.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Regardless of the improvements in the efficiency of energy consumption of information and communication technology, energy consumption will forever be a requisite for software execution. Consequently, researchers have promoted the development of green and sustainable software with new development methods and tools. These, however, have been adopted with limited success due to technicalities and specific language/platform requirements. In this paper we introduce a portion of our Behavior-Based Consumption Profiles (BBCP). A platform and language agnostic software behavior profiling approach, aimed at estimating the energy consumption of software from the analysis and design phases of the Software Development Life Cycle (SDLC). The profiles, in a JSON format, contain properties whose values provide and control specific descriptions of the software's behavior. Throughout the paper, these properties and their underlying mechanics are explained from a perspective of software services, to conclude with an experiment where a real-world service is profiled and its BBCP is simulated to obtain its behavior. ", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Base et Traitement de données, IA"]},
{"abstract":"The work presented in this article focuses on the opportunity to use the digital twin of the complex system, a concept popularized in recent years, as a Decision Support System. In studying the phenomenon of human decision making, the concept of situation awareness appears to be of primary importance when dealing with these complex systems. Given the complexity of the system to be represented in the digital twin, the concept of reality anchor is proposed to identify the elements of the studied situation necessary for the user to perceive, understand and project the situation he is facing. A methodology, called the Reality Anchor Methodology, has been defined to ensure the elicitation and the implementation of these elements in a digital twin. This methodology is composed of three steps that aim (1) to elicit the reality anchors through a study of the operators’ tasks and activities, (2) to design a prototype for the realization of human-in-the-loop tests and (3) to validate the definition of the reality anchors. This method was applied to a case study in the energy domain and allowed to validate the importance of the defined reality anchors for the decision-making process.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Deploying Connected and Automated Vehicles (CAVs) on top of 5G and Beyond networks (5GB) makes them vulnerable to increasing vectors of security and privacy attacks. In this context, a wide range of advanced machine/deep learning-based solutions have been designed to accurately detect security attacks. Specifically, supervised learning techniques have been widely applied to train attack detection models. However, the main limitation of such solutions is their inability to detect attacks different from those seen during the training phase, or new attacks, also called zero-day attacks. Moreover, training the detection model requires significant data collection and labeling, which increases the communication overhead, and raises privacy concerns. To address the aforementioned limits, we propose in this paper a novel detection mechanism that leverages the ability of the deep auto-encoder method to detect attacks relying only on the benign network traffic pattern. Using federated learning, the proposed intrusion detection system can be trained with large and diverse benign network traffic, while preserving the CAVs’ privacy, and minimizing the communication overhead. The in-depth experiment on a recent network traffic dataset shows that the proposed system achieved a high detection rate while minimizing the false positive rate, and the detection delay.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes", "Communications, Infrastructures et Connectivité"]},
{"abstract":"Refurbishing existing building into Near Zero Energy Building (NZEB) is a key objective for the European Union. In order to achieve high rate of conversion, new refurbishment process must allow Decision Makers (DMs) (architects or designers) to sort through an ever increasing list of new technologies while taking into account uncertain preferences from multiple stakeholders. A Decision Support System (DSS) based on Multi-Criteria Decision-Making (MCDM) approaches is proposed. The DSS enables the DMs to browse the solutions space by selecting the relevant criteria, order them by preferences and specify the granularity in the assessment of the technologies regarding each criteria. This DSS is based on a ranking algorithm that operates on multiple types of quantitative (continuous, discrete, or binary) and qualitative (nominative or ordinal) variables from technological and human sources. An online user interface allows the real-time exploration of the solution space. A sensitivity analysis of the algorithm is conducted to expose the influence of the ranking algorithm parameters and to demonstrate the robustness of this algorithm. The proposed DSS is eventually implemented and validated through a use case concerning the choice of insulating materials considering heterogeneous criteria that model sustainable constraints. ", "themes":["Base et Traitement de données, IA"]},
{"abstract":"This work aims to provide a better understanding of the wheel-vehicle aerodynamic interaction, via experimental investigations on a 2/5-th scale vehicle equipped with 2/5-th scale rotating wheels. The findings demonstrate that the baseline configuration has a well-balanced wake, which means that the distribution of TKE in the symmetrical plane of the vehicle wake is symmetric in the upper and lower shear layers. This well-balanced wake can be easily modified by different wheel states or tire modifications, especially at the rear axle. This results from a global effect of the underbody momentum modifications. On the contrary, when the vehicle mean wake develops into a non-balanced topology, it is more robust towards underbody perturbations. By eliminating front wheels, the underbody flow momentum is vastly increased; by eliminating the underbody diffuser, the underbody flow momentum is significantly reduced. In these two circumstances, one can observe a robust downwash from the roof, independent of the wheel states or tire modifications. Besides, there is a more local effect of the wheels’ near wakes on the aerodynamic lift and drag of the vehicle. Low pressure regions in the underbody downstream the wheels have an effect on vehicle lift. The rear wheel wakes interact with vehicle wake, imposing pressure conditions on the vehicle base, therefore influencing the vehicle drag.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"The deployment of high-speed automated trains is a worldwide objective for railway stakeholders. The French railway operator SNCF has conducted several safety-oriented analyses and studies to better understand Automated Train Operation (ATO) impacts. But none of them is supported by human-the-loop simulation (HITLS). In PRODEC, AS-IS scenarios based on existing declarative configurations can help to project TO-BE scenarios based on new declarative configurations of the system to be designed. This paper is dedicated to the task analysis of the scenarios selected and constructed by safety analysis. The comparison between the train driver’s tasks in AS-IS scenarios at Grade of Automation 1 (GoA1) for manual driving and the train driver’s tasks in TO-BE scenarios at Grade of Automation 2 (GoA2) for teaming with ATO and ETCS enables to discover design gap and tasks evolutions to project potential functions and infrastructures.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Wind turbines operate under random and harsh operating conditions due to several environmental factors. The main source of disturbance is the wind profile due to wind shear and tower shadow influence on the aerodynamic torque driving the system. Disturbed aerodynamic torque induces unwanted operating conditions for all wind turbines subsystems. This study proposes a novel combined unknown input observer (UIO) and linear parameter varying (LPV) approach. In a first instance an UIO approach for disturbance isolation in the input aerodynamic torque as a simple, fast and accurate method. In addition, a comparison with an Extended Kalman filter approach for disturbance isolation is introduced. Then, when the isolation occurs, an LPV controller is used as an active controller for disturbance attenuation in the speed range of the wind turbine. The LPV controller injects a current signal into the generator opposing the disturbance signature introduced by the wind profile. The aim of the UIO-LPV strategy is limiting the amount of generated current and being able to extend the amount of disturbance attenuation. The strategy is applied to a permanent magnet synchronous generator (PMSG) based wind turbine with experimental tests and results by the means of a test rig.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Can we contribute to developing a consistent terminology and, to some extent, an acceptable ontology in the rapidly expanding field of human systems integration (HSI)? We often define HSI as a process and a product at the confluence of several areas, such as systems engineering, human factors and ergonomics, information technology, and specific sectors, such as aerospace, health, and energy. It is a broader transdisciplinary field in our increasingly complex human-machine world that focuses on integrating technology, organizations, and people within a complex sociotechnical system throughout its life cycle. Therefore, HSI is no longer a question of usability and user interface design once a complex machine is technologically developed, but also about considering people and organizations early on in the design and development processes. Indeed, rooted in industrial engineering research and operational worlds, HSI requires a deeper foundation based on an epistemological approach. This assertion is even more crucial today as technology has become predominantly digital, and, more specifically, the concept of the digital twin is emphasized because it has become essential to support model-based HSI. In other words, software-based assistant systems are replacing traditional tools. Therefore, appropriate social-cognitive (multi-agent) models and methods are helpful throughout the life cycle of contemporary sociotechnical designs to account for the complexity and tangibility of their human-centered context-sensitive architectures, combining procedural and declarative knowledge. By considering these reasons, this article provides a set of fundamental axioms, some theoretical abstractions, and valuable practical models, which are presented and illustrated through the lens of an evolutionary HSI ontology.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Cooperative Perception (CP) allows Connected and Autonomous Vehicles (CAVs) to enhance their Environmental Awareness (EA) by sharing locally perceived objects through CP messages (CPMs). European Telecommunications Standards Institute (ETSI) has recently defined a set of CPM generation rules to achieve a trade-off between EA and Channel Busy Ratio (CBR) despite massive perception data. Nonetheless, these rules still lack the consideration of information usefulness, resulting in a considerable volume of useless information transmitted in the CP network. This limitation could increase CBR and thus decrease EA due to the loss of CPMs in the network. This paper introduces CloudAC-IU, a cloud-based deep reinforcement learning approach to lean CAVs to maximize perception information usefulness in the network. Simulation results highlight that the CloudAC-IU enhances EA by decreasing CBR and increasing CPM reception for CAVs compared to state-of-the-art works.", "themes":["Capteurs et Traitement du signal", "Base et Traitement de données, IA"]},
{"abstract":"The increase in popularity of wireless networks in industrial, embedded, medical and public sectors has made them an appealing attack surface for attackers who exploit the vulnerabilities in network protocols to launch attacks such as Evil Twin, Man-in-the-middle, sniffing, etc., which may result in economic and non-economic losses. To protect wireless networks against such attacks, IEEE 802.11 keep updating the protocol standards with new and more secure versions. There has always been a direct correlation between attacks and the improvement of protocol standards. As the sophistication of attacks increases, protocol standards tend to move towards higher security, resulting in a significant rise in both latency and computational overhead, and severe degradation in the performance of low-latency applications such as Industrial Internet of Things (IIoT), automotive, robotics, etc. In this paper, we make an attempt to highlight the importance of both latency and security in wireless networks from implementation and performance perspective. We make a review of existing IEEE 802.11 protocols in terms of security offered and overhead incurred to substantiate the fact that there is a need of a protocol which in addition to providing optimum security against attacks also maintains the latency and overhead. We also propose a secure and low-latency protocol known as Secure Authentication Protocol (SAP) which operates in two phases - registration and authentication, where the first phase is a one time process implemented using asymmetric cryptography and the second phase is implemented using symmetric cryptography. The protocol is structured in a way that it maintains the original structure of IEEE 802.11 protocols and performs both phases using fewer messages than existing protocols. By simulating the protocol using well-established OMNeT++ simulator, we proved that the proposed protocol incurs a low computation overhead, making it ideal for low-latency applications. We extensively verified the security properties of the proposed protocol using formal verification through widely-accepted Scyther tool. Finally, we perform a comparative analysis of SAP with existing IEEE 802.11 wireless network protocols to highlight the improvement.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Uncertainty happens when people do not have enough information about a situation that compels them to act. The less correct information they have, the more their judgment will be based on beliefs and levels of trust. Conversely, the more they have correct information and knowledge, the more they will be certain of acting the right way. Uncertainty, ignorance, possibility, chance, and necessity are intimately related. Uncertainty is also related to situation awareness, which can be modeled as perception, comprehension, and projection. This is the reason people try to develop methods and tools to improve perception through various kinds of visualization techniques, comprehension through various kinds of reasoning techniques and tools (in the artificial intelligence sense), and projection through various kinds of abduction mechanisms (i.e., anticipate what will or could happen next). Accurate prediction can only refer, from a short-term perspective, to what happened before a situation is perceived (i.e., an event-driven or reactive causal approach). Conversely, longer term anticipation allows for guessing possible futures and testing them (i.e., a goal-driven or intentional approach). Claiming that uncertainty in systems engineering and complex operations is a matter of situation awareness, the proposed approach is based on a situational systemic framework, where complexity and flexibility are central factors to be considered to manage uncertainty in life-critical systems.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Micro-mobility refers to a variety of small and lightweight vehicles designed for individual use. These new vehicles are inexpensive, simple to operate, and enjoyable to ride, making them the easiest and most suitable mode of transportation for trips of less than five miles. They have become extremely popular, especially with the advent of free-floating systems that offer users flexible parking in order to facilitate the rental process. However, the problem of imbalance and maldistribution is among the major challenges of these systems, causing dissatisfaction and loss of customers. Therefore, to ensure the balancing of the fleet and to make the best decision for its reorganization, we must consider strategic locations that are accessible to all. In this paper, we propose a machine learning model for spatio-temporal demand forecasting using a multi-output regression technique. The main goal of the paper is to help pick the ideal areas for fleet deployment and balance the system according to user needs. Our solution, designed for public electric scooters, is based on the estimation of user demand over a grid-based service area. In addition, we propose an enhanced solution that outperforms other baseline models, including the Random Forest, Gradient Boosting, and Stacking Regressor.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"As stated in the literature, Low Power Listening (LPL) duty cycle is one of the most common energy conservation solution for WSN. By using channel check mechanism, the purpose of LPL solutions is to reduce the energy consumption of the listening phase. In this paper, we propose to study the performances and limitations of this kind of solutions. Therefore, we deploy a ContikiMAC LPL on both real and simulated WSN platform to demonstrate the impact of LPL on the energy consumptions of the node radio and microcontroller but also on the application Quality of Service. Based on the obtained results, shortcomings of LPL solutions are highlighted and potential improvements are discussed such as the use of multi-parameter dynamic duty cycle.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Capteurs et Traitement du signal", "Communications, Infrastructures et Connectivité"]},
{"abstract":"Wireless sensor networks (WSNs) are composed of sensors exchanging the information that they collect from the environment. The use of a scheduler offers an efficient solution to eliminate information redundancy and possible collisions in this network. A scheduler is responsible for choosing the sensors to exchange information at each step of the algorithm's execution. This article presents a WSN handshake algorithm (WSN-HS) scheduling the communications between every two sensors safely in an exclusive mode. Our WSN-HS is energy-efficient. It tries to elaborate communications between sensors with the minimum of messages and thus with the minimum of energy consumption. In addition, our algorithm is fault-tolerant to sensors' disappearance. Hence, when a sensor runs out of energy, the other sensors in the network will not be blocked and they will continue executing the distributed algorithm. We compare and evaluate our algorithm with another handshake algorithm. The results of the simulation done with two examples of distributed algorithms show that our algorithm significantly minimizes the energy consumption in the WSN. Moreover, in this article, we detail the analysis that emphasizes the efficiency of our WSN-HS algorithm.", "themes":["Capteurs et Traitement du signal", "Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"This paper investigates the impact of a network modification on the multimodal transportation system in the Rouen Metropole Normandy region of France using an agentbased transport simulation model. The use of a multi-agent simulation tool allows for a more realistic and accurate representation of individual transportation behavior and enables transportation planners to evaluate the impact of proposed changes on the entire transportation network. To this end, we use MATSIM (MultiAgent Traffic Simulation) tool to develop the considered scenario in which a network update is operated by developing bicycle stations and new transport lines.The simulation parameters used in this study were adapted to the French population based on the MATSim Ile de France scenario, ensuring that the simulation results were applicable and relevant to the transportation system in the Rouen Metropole Normandy region. The main obtained results shows an increase in bike usage (+1.8%) and car-sharing (+1.4%), and a decrease in travel time (-6%). These findings suggest the potential benefits of eco-friendly transportation modes and the need for solutions to address traffic congestion.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Nowadays, connected vehicles are becoming quite complex systems which are made up of different devices. In such a vehicle, there are several electronic control units (ECUs) that represent basic units of computation. These ECUs communicate with each other over the Controller Area Network (CAN) bus protocol which ensures a high communication rate. Even though it is an efficient standard which provides communication for in-vehicle networks, it is prone to various cybersecurity attacks. This paper aims to present a systematic literature review (SLR) which focuses on potential attacks on CAN bus networks. Then, it surveys the solutions proposed to overcome these attacks. In addition, it investigates the validation strategies aiming to check their accuracy and correctness.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Vacuum systems play an essential role in industrial installations. This system is subject to various operating conditions, making it susceptible to failures that can cause real damage in the working environment. Online condition monitoring is therefore necessary to quickly detect any malfunction and avoid its consequences. It increases the life of system components while reducing maintenance costs and downtime. Various techniques can perform this task. In this paper, we have relied on the transient motor current signature analysis. The system studied is a vacuum system located in the Municipal Technical Center of Poitier, France. Matlab/Simulink program was used to build a digital twin of this system and create several types of faults at different operating speeds. Four Adaptive Notch Filter techniques were developed, based different structures, which are: Chambers’ all-pass structure, Regalia’s all-pass solution, Cho, Choi & Lee’s all-pass method, and M’Sirdi’s structure, in order to identify the system faults. M’Sirdi’s structure, which is the most recent technology, was discussed in detail. The comparison between the results of the four methods was presented, where the simulation results proved their effectiveness in achieving the desired goal, with the superiority of the M’Sirdi structure.", "themes":["Base et Traitement de données, IA"]},
{"abstract":"The automotive market is undergoing revolutionary technological transformations, leading to today’s Cooperative Intelligent Transport System or C-ITS. This latter raises challenging demands in terms of coverage and connectivity to ensure ultra-low latency and ultra-high reliability under high mobility and density conditions. This work focuses on the C-ITS standardized by ETSI, and whose access network relies on the ITS-G5 technology to achieve V2X services. This paper proposes an ITS-G5 RAN slicing architecture that integrates new modules via the ITS protocol stack to create multiple RAN slices with different priorities and provide secure access to a given slice while performing traffic shaping and policing as well as traffic prioritization and isolation between different slices.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"In order to limit greenhouse gas emissions, urban travel is a central point of interest for metropolises as part of their actions in favor of ecological transition. MUST-B is a land use transport interaction (LUTI) model that simulates the location choices of households and jobs. It models and simulates the interaction both of the population of an agglomeration through its residential choices with activities and jobs, but also the different modes of transport to satisfy daily mobility. This tool based on the agent-based paradigm makes it possible to apprehend the complexity of an urban territory from individual behaviors giving rise to collective phenomena. In this article, we concentrate on the “transport” part of the tool, show how the elaboration and the calibration of this model are done, and study an example of its reaction to a variation of setpoints.", "themes":["Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"The use of Cooperative Perception (CP) enables Connected and Autonomous Vehicles (CAVs) to exchange objects perceived from onboard sensors (e.g., radars, lidars, and cameras) with other CAVs via CP messages (CPMs) through Vehicle-to-Vehicle (V2V) communication technologies. However, the same objects in the driving environment may simultaneously appear in the line of sight of multiple CAVs. Consequently, this leads to much irrelevant and redundant information being exchanged in the V2V network. This overloads the communication channel and reduces the CPM delivery to CAVs, thereby decreasing CP awareness. To address this issue, we mathematically formulate CP information usefulness as a maximization problem in a multi-CAV environment and introduce a distributed multi-agent deep reinforcement learning approach based on the double deep Q-learning algorithm to solve it. This approach allows each CAV to learn an optimal CPM content selection policy that maximizes the usefulness of surrounding CAVs as much as possible to reduce redundancy in the V2V network. Simulation results highlight that the proposal effectively mitigates object redundancy and improves network reliability, ensuring increased awareness at short and medium distances of less than 200 m compared to state-of-the-art approaches.", "themes":["Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"The objective of vehicular communication is to improve road safety and traffic efficiency through various cooperative intelligent transport system (C-ITS) services. These services allow information exchange between vehicles and other communication entities (e.g., vehicles, infrastructure, pedestrians). In addition, many advanced services are envisaged to support autonomous vehicles and safety applications. Therefore, the performance requirements of such services are considered highly critical for road safety. However, all these services increase the channel load, and thus, it isn’t easy to differentiate which service has a higher priority for accessing communication channels. In this paper, we focus on the classification of C-ITS services, which allows the cohabitation of all services considering the strict performance requirements for some services. The aim is to classify C-ITS services based on their packet delay requirements to define higher priority for critical services to ensure their dissemination, especially under congestion conditions. Then, we present protocols and quality of service (QoS) mechanisms that can map this classification to the available vehicular networks.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"With the widespread usage of Internet-enabled devices, the Internet of things (IoT) has become popular and well integrated in different countries nowadays. However, the huge amount of data generated from several smart devices in the same IoT network, security of the network and the limited devices capacities of storage and process are a very big concern. To treat such a large database generated from all devices in the IoT network and to handle their security issues, Software Defined Network (SDN) has emerged as a key approach. Keeping focus on security challenges, several entities must authenticate each other before any communication to ensure a trusted network. We adopt in this paper the SDN architecture for an IoT environment, including authentication schemes for things and users based on Elliptic Curve cryptography (ECC). ", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"This paper presents a systematic literature review of platooning systems with a special focus on the strategies which have been adopted to validate platooning algorithms. We collect the existing studies in the platooning field. The proposed algorithms are compared based on some criteria including platooning operations, communication modes, and validation strategies. Our paper allows researchers to identify the contributions that deal with some issues related to platooning systems. Also, it shows several challenges which need to be tackled.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"Possibilistic decision theory has been proposed twenty years ago and has had several extensions since then. Even though ap-pealing for its ability to handle qualitative decision problems, possibilisticdecision theory suffers from an important drawback. Qualitative possibilistic utility criteria compare acts through min and max operators, which leads to a drowning effect. To over-come this lack of decision power of the theory, several refinements have been proposed. Lexicographic refinements are particularly appealing since they allow to benefit from the Expected Utility background, while remaining qualitative. This article aims at extend-ing lexicographic refinements to sequential decision problems i.e., to possibilistic decision trees and possibilistic Markov decision processes, when the horizon is finite. We present two criteria that refine qualitative possibilistic utilities and provide dynamic programming algorithms for calculating lexicographically optimal policies. ", "themes":["Base et Traitement de données, IA"]},
{"abstract":"On a French scale, road freight transport accounted for 17% of CO2 emissions in 2018. In fact, road transport is the predominant mode and represents 88% of total flows. In order to make a successful transition to a low-carbon economy, a sustainable solution is to transfer part of these flows to other modes with little or no carbon emissions.To study this, a monograph of a player: DB Schenker, with case studies on certain points from other players (carriers and shippers), has been conducted to analyze its entire transport chain. This work is based on operational databases that make it possible to explain the global system with precision and then to evaluate the impact of a modal shift for a player. Two solutions were studied: cargo bikes for the first and last kilometers, on the one hand, and railways for the long distance, on the other.The study of a carrier's operations shows that the bundle of operations is not just about the link between long-haul networks and the first and last mile. It is a complex bundle in which each element is intertwined: within the long-distance network, routings are scheduled to allow a parcel to take several connections in one night; on the first and last mile side, carriers implement a strategy of polycentrism to operate in large areas resulting in optimal locations of platforms on the outskirts of cities.The study on the location of the platforms having underlined the interest of locating them on the outskirts of the center, the use of cargo bikes relies, therefore, on the establishment of micro-hubs. However, this real estate cost must be compensated by the lower operational cost of cargo bikes compared to trucks, provided that the density is high. In a way, this work provides a link between the literature on vehicle fleet choices and the one on logistics real estate. This being said, the use of cargo bikes does not mean the end of trucks in the city: they will still be necessary to supply micro hubs as well as to operate parcels that cannot be operated by a cargo bike.The two-stage study of combined transport shows, first of all, a mismatch between the current offer in France and the expectations of a parcel service, both from an organizational point of view and from the point of view of spatial coverage. Leaving aside the economic constraint, it would be possible to transfer only 0.2% of daily trips. In a second step, the study of a consortium of 9 companies (shippers and carriers) has highlighted the need for mutualization to allow the trains to be fully filled. This makes it possible to increase the flows on the axes and thus to increase the number of rotations, so that the manufacturers do not have to modify the organization of their supply chain. However, it has been shown that pooling can lead to a win/lose situation when viewed at the level of the player from an economic point of view, even though the operation is interesting overall.Overall, this work highlights the interest of an approach by actors for a more detailed understanding of certain situations in the context of freight transport. This approach provides a complementary vision to studies based on public statistics. Without opposing it, it can sometimes drastically modify the conclusions, such as the emphasis on a win/lose dynamic in the case of combined transport", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Salient features of wheel–vehicle interactions and their consequences for drag are investigated experimentally based on a simplified square-back vehicle with different distances l between the rear wheels and the base of the vehicle. Two different mechanisms responsible for a base drag increase of up to 12% are distinguished. At the scale of the vehicle, whatever the distance l, wheels perturb the underflow and induce a global variation of the vertical balance of the vehicle wake. According to the state of the initial wake, significant base drag increase or decrease are observed. Considering the scale of the wheels, if the wheel-to-base distance l/w (w being the width of the wheels) is smaller than a threshold of order 3 in the present configuration, the base drag increases and is very sensitive to l/w. In this situation, a mean mass transfer from the vehicle wake to the wake of the rear wheels is observed. Based on these observations, a physical model is then proposed to explain this high-sensitivity regime.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"This work aims to highlight the influence of the scale of reproduction of geometric details on models during wind tunnel tests. An application is presented concerning the reproduction of high voltage lines present on the roof of trains. It is shown that the presence of these geometric artefacts deeply modifies the forces and moments measured under cross-wind. It is also shown that the reproduction of geometric details with the scale of the model is not a sufficient condition to ensure a good representativeness of the tests. It is necessary to ensure that the changes in the flow dynamics caused by the presence of the details are correctly reproduced (separation-reattachment process on the roof of the train in this study). The influence of the scale of reproduction of the geometrical details is also studied and a method is proposed to extrapolate the results obtained without roof-lines in order to predict the rolling moment in the presence of roof-lines.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"The performance of vehicular communication technologies changes dynamically according to the application requirements considering data rate, communication ranges, latency, etc. These applications are evolving rapidly and should enhance intelligent transport systems (ITS) such as road safety and automated driving. However, to reach the required quality, these applications need many radio resources to carry the potential traffic load resulting from the environmental perception and data exchanged between the different entities. Therefore, an assessment of vehicular communication technologies’ reliability and resilience under these conditions is required to address the multiple challenges of the ITS services. The paper’s main contribution is to propose a comprehensive analysis model able to evaluate and compare the performances of ITS technologies according to different constraints related to environment-changing situations. This analysis examines the channel occupancy and provides simulation results which allow the identification of the suitable configurations and the most appropriate technology for a given use case. We also propose a coexistence solution between these technologies based on density-sharing according to the use case requirements and the availability of the technology. Finally, we present the challenge of adaptive configuration in vehicular networks, which helps to provide the optimal structure through road profiles and environment variability (infrastructure, data, etc.). Results show different trade offs and limitations between the considered ITS technologies, which are essential to understand their behaviour in a realistic environment.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"Vehicular applications in smart cities, such as assisted and autonomous driving, require sophisticated data processing, low latency, and high throughput data transmission. Edge Computing is a leading approach designed to meet those application requirements. By deploying Edge servers at the network's edge, close to the vehicles, such applications can be successfully delivered while adhering to low-latency and high-throughput requirements. However, optimal placement of Edge servers is challenging since it necessitates a trade-off between quality of service and deployment cost. Latency can be reduced by placing as many Edge servers as feasible close to the vehicles, however, this results in significant deployment costs. This work addresses the problem of optimal Edge server placement. It solves this problem using integer linear programming, considering the relation between delay and cost, as well as the capacity of Edge servers in realistic road traffic scenarios. The proposed generic methodology is designed to reduce the cost of deploying Edge servers by combining the achievement of the desired latency threshold with workload balancing between Edge servers. We evaluate the efficiency of the proposed solution mathematically and through simulations based on open data from real vehicles traffic on roadways of Bordeaux, France. The obtained results demonstrate that our solution outperforms existing Edge server placement approaches, especially on workload balancing.", "themes":["Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA", "Capteurs et Traitement du signal"]},
{"abstract":"The oil-and-gas industry is known to be part of the most safety-critical domains. Safety culture has prompted such companies to implement new systems to support decision-making. In this paper, we explore the use of digital twins to support situation awareness as a crucial part of real-time decisionmaking processes. Therefore, this paper presents requirements for the development of an eight components digital twin. Human-centered approach contributes to add useful information based on user needs and user experience to the usual theoretical process. This user-centered information helped shape both digital twin components and the situation awareness model.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Nowadays, several countries have adopted an energy transition policy to achieve carbon targets and decarbonize transport while improving their electricity mixes. Electric vehicles are ubiquitous, considering its role in the energy transition as a promising technology for large-scale storage of intermittent power generated from renewable energy sources. However, the widespread adoption and commercialization of EV remain linked to policy measures and government incentives. Here in this work, we review the current bottlenecks and key barriers for large-scale development of electric vehicles. First, the impact of massive integration of electric vehicles is analysed, and the energy management tools of electric energy storage in EVs are provided. Then, the variety of services that EVs may provide is investigated. We also, highlight how the optimal placement and sizing of EV charging infrastructure can plays a crucial role in electric vehicle development. The different methods for Li-ion battery states estimation and cells characterization are outlined. Furthermore, we present the different incentives to accelerate EVs adoption. And finally, we provide insightful suggestions and policy recommendations for future studies. The work presented in this paper will be very beneficial for policymakers seeking to promote electric mobility, and advance sustainable EV technologies.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"A combination of passive and active methods is used to manipulate the symmetry of the turbulent wake of an Ahmed body. Dedicated experiments to study the wake reversals occurring between symmetry-breaking states are performed. We show how transient symmetric states explored during the reversals differ from static symmetry-breaking states in the flow organization they induce. In asymmetric states, a strong interaction and coupling between the recirculating flow from one side and the shear layer from opposite side triggers shear-layer instabilities and their amplification. The resulting large-scale flow engulfment in the recirculation region increases the recirculation intensity and thus increases base drag. By contrast, during the wake reversals the disorganization of the recirculating flow leads to a transient symmetric state with prevented shear-layer interaction and triggering mechanism with a concomitant drag reduction of ∼8% compared to symmetry-breaking states. Finally, recent experimental results for unbalanced wakes and methodologies addressing the control of wake asymmetries for drag reduction are discussed and interpreted based on the present findings. This leads us to provide new insights in control methods for wake asymmetries.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"A volumetric identification of drag sources is proposed using the Reynolds equation for the integral mean momentum and mean flow kinetic energy balance. This methodology works independently of the turbulence model used in CFD and relies on a physical interpretation. The approach, developed in the context of automotive engineering, is of general use. A road vehicle is indeed a complex multi-scale geometry and all the flow regions are interacting. As far as the kinetic energy of the mean flow is concerned, the main volumetric loss is production of turbulent kinetic energy at all relevant sub-scales of the body. The quantitative link to the power of the mean drag force is derived from first principles. For practical applications, the volume integral used to compute the volumetric losses can be decomposed in user-defined regions and integrated into optimization loops. Indeed, if losses in a given flow region are minimized, consequences can be precisely and quantitatively evidenced for all other regions. Applications to a model two-dimensional test case and a real car geometry are discussed.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Given the emergence of two-echelon distribution systems in several practical contexts, this paper tackles, at the strategic level, a distribution network design problem under uncertainty. This problem is defined as the two-echelon stochastic multi-period capacitated location-routing problem (2E-SM-CLRP). It considers a network partitioned into two capacitated distribution echelons: each echelon involves a specific location-assignment-transportation schema that must cope with the future demand. It aims to decide the number and location of warehousing/storage platforms (WPs) and distribution/fulfillment platforms (DPs), and on the capacity allocated from first echelon to second echelon platforms. In the second echelon, the goal is to construct vehicle routes that visit ship-to locations (SLs) from operating distribution platforms under a stochastic and time-varying demand and varying costs. This problem is modeled as a two-stage stochastic program with integer recourse, where the first-stage includes location and capacity decisions to be fixed at each period over the planning horizon, while routing decisions of the second echelon are determined in the recourse problem. We propose a logic-based Benders decomposition approach to solve this model. In the proposed approach, the location and capacity decisions are taken by solving the Benders master problem. After these first-stage decisions are fixed, the resulting sub-problem is a capacitated vehicle-routing problem with capacitated multiple depots (CVRP-CMD) that is solved by a branch-cut-and-price algorithm. Computational experiments show that instances of realistic size can be solved optimally within a reasonable time and provide relevant managerial insights on the impact of the stochastic and multi-period settings on the 2E-CLRP.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité", "Base et Traitement de données, IA"]},
{"abstract":"With an increasing number of vehicles equipped with ACC (Adaptive Cruise Control), the impact of such vehicles on the traffic flow becomes significant. Especially in the zones where traffic safety is a concern. Here, we can mention roads where traffic is characterized by its 'stop and go' particularity. One of the widely used and well-known algorithms to serve as the basis for a control algorithm of a real-world ACC system is the IDM (Intelligent Driver Model). This contribution analyzes the IDM, a CFM (Car-Following Model) governed by a system of differential equations. The model, in recent years, has been intensively studied for capturing traffic phenomena properly and making driver braking behavior safer. Despite the intensive analyses, to our knowledge, a rigorous study of comfortable braking, when an emergency occurs, has rarely been performed. Especially when vehicles' densities and speeds are in constant variation and when, in most situations, urgent braking is necessary. In this work, we modify the classic IDM to introduce the O-IDM (Optimized-Intelligent Driver Model). We increase safety distances between vehicles to prevent accident risks without permitting vehicles' velocities to become negative or to diverge to -∞ in finite time. We personalize IDM parameters for each type of vehicle and we aim to make the transition of the traffic flow from 'free flow' to 'stop and go' traffic more comfortable. We compare the obtained O-IDM results to the Krauss-FM (Krauss-Following Model) and to the classic IDM to prove the efficiency of our approach.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Human systems integration (HSI) is an essential field of systems engineering (SE) that emerged, departs, and encompasses from its initial components that are human factors and ergonomics, human-computer interaction, engineering, and domain experience. Current capabilities and maturity of virtual prototyping and human-in-the-loop simulation (HITLS) enable virtual human-centered design (HCD) that can be combined with SE to realize HSI. HSI is almost necessarily model-based; it uses HITLS and requires a homogenized human and machine systemic representation. Virtual HCD enables us to take into account both human and organizational elements not only during the design process but also during the whole life cycle of a system. These new capabilities are made possible by digital tools that enable virtual environments that in turn should be made tangible. Digital twins can be solutions for supporting HSI, operations performance, and experience integration. Tangibility is therefore a crucial concept in model-based HSI (MBHSI), which should be both analytical and experimental, based on appropriate scenarios and performance metrics essentially supported by domain experience. An aeronautical example illustrates an instance of MBHSI.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"The Intelligent Transportation System protocol stack (ITS-G5/802.11p) supports traffic efficiency and road safety applications in vehicular environments. This protocol allows the vehicle to send continuous status information about road traffic to nearby vehicles or asynchronous warning notifications when an emergency occurs. The former is established by Cooperative Awareness Message (CAM), while the latter is disseminated as Decentralized Environmental Notification Message (DENM). In this work, communications between connected vehicles are based on ITS-G5 specifications considering a realistic Level Crossing (LC) environment in Bordeaux, France. Vehicle to Vehicle (V2V) and Vehicle to Infrastructure (V2I) communications are adopted to exchange both periodic and urgent notifications. An algorithm that explains the messaging strategy is proposed when an emergency occurs. The Packet Reception Ratio (PRR) and the End-to-End (E2E) delay are used as performance metrics to prove its efficiency and study the latency. We consider the simulation of a bus blockage use case at Level Crossing to validate our algorithm independently of vehicle density and speed variations in the considered urban area. We opt for minimizing the accident rate by relying on ITS-G5 particularities for real-time signaling. The proposed communications order and the given behavior of the connected vehicles in the chosen experimental site define a pilot prototype. The latter will be generalized in future work in other chosen sites to prove the efficiency of our messaging proposal in making both road and rail traffic safer.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"The present work is aimed at developing a simplified model for investigating numerically a Li-Ion battery pack storage with phase change material (PCM). The developed model is based on the energy balances for the battery cells and the PCM with a heat generation source. To simulate the phase transition phenomena in the PCM, the PCM specific heat capacity is expressed as a temperature-dependent function. The verification of the proposed model is carried out by comparing the numerical results with the experimental data from the literature and the maximum relative error obtained is approximately 6%. With the help of the validated model, the battery pack is explored during both charge and discharge cycles and the effect of various design and operating parameters on the battery temperature is reported and discussed. Results show that the use of PCM in the battery pack is appropriate and reduces the maximum battery temperature by up to 3 °C compared to a battery pack without PCM. Improving the airflow around the storage system can significantly increase the thermal management performance of the PCM and reduce the maximum temperature of the batteries by up to 2.5 °C. It has been also shown that PCM A-32 H is suitable for the battery pack than PCMs RT-31, RT-35 HC and A-36 due to its transition temperature and to its high latent heat of fusion. Eventually, the fast and simplified thermal model can be employed by battery pack designers to explore and optimize the thermal management system of the PCM with reasonable accuracy.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Buildings are one of the biggest energy consumers and greenhouse gas producers. Technology could help reduce their environmental impact by deploying sensors to collect relevant data about the way energy is consumed, and with the aim to optimize it. For this sake, understanding building occupant's behavior and occupancy patterns can help minimize energy consumption while satisfying occupant's comfort. Indeed, occupants directly influence building appliances that consume energy, such as HVAC, ovens, hot water tanks, etc. In this paper, we aim at predicting occupants' movements among rooms and use the predicted movements to deduce room and space occupancy in the building. The latter is then used to preheat/pre-cool rooms. However, since prediction models are not always that accurate, it is possible to face situations where HVAC of some rooms are activated while these are empty or vice-versa, leading to either a waste of energy or a lack of occupant's comfort. To deal with this issue, we make use of sensors to detect real-time occupancy of building rooms and then correct the prediction when necessary. To achieve this, we developed a graph mining-based optimization approach that combines occupant behavior prediction and a real-time correction. We experimented our approach on simulated data and results showed that our model optimizes up to 39.09% of HVAC energy consumption, and provides up to 99.39% of occupants' comfort.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"This research work aims to improve collective decision making and learning through a digital twin of the organisation in the context of a complex industrial activity such as helicopter engine maintenance. Through field and literature studies, it was determined that the digital twin should be based on a multi-agent system model for reasons of flexibility and modularity necessary in this constantly changing environment. The digital twin is intended to adapt to the organisation but also to improve it by including missing information flows. This paper presents the multi-agent model of the socio-technical system and its digital twin, the chosen agent model inspired by reinforcement learning, and how it has helped to identify these missing flows. It shows the importance of the interfaces in the digital twin and what they must contain to integrate the agents, as well as the psychosocial aspects to be considered so that humans can manage their design.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Possibilistic decision theory has been proposed twenty years ago and has had several extensions since then. Because of the lack of decision power of possibilistic decision theory, several refinements have then been proposed. Unfortunately, these refinements do not allow to circumvent the difficulty when the decision problem is sequential. In this article, we propose to extend lexicographic refinements to possibilistic decision trees. We show, in particular, that they still benefit from an Expected Utility (EU) grounding. We also provide qualitative dynamic programming algorithms to compute lexicographic optimal strategies. The paper is completed with an experimental study that shows the feasibility and the interest of the approach.", "themes":["Base et Traitement de données, IA"]},
{"abstract":"In emerging markets, the growth of supply chain networks and logistics industry leads to a significant increase in energy consumption and induces high carbon emissions. To design a sustainable low-carbon supply chain network, we consider a carbon emission-compliance green location-inventory problem. It is characterized by uncertain demand and volatile carbon prices under a multi-year emission regulation, inspired from the carbon-trading scheme in China. A two-stage stochastic mathematical model is built and is solved with a three-phase hierarchical metaheuristic on extensive numerical experiments, which mimic the business context of a supply chain network operated in China. The results show to which extent the carbon-trading emission-compliance scheme, with uncertainties in demand and carbon price, impacts the strategic decisions. Besides, carbon emissions and supply chain profits of the design solutions produced under alternative emission regulations are evaluated and discussed. We also underline the sensitivity of the amount of carbon emissions to the demand uncertainty, and to the level and volatility of the carbon price in the carbon-trading system. These results provide managerial insights for supply chain emitters, and indicate that reasonable and stable carbon prices should be maintained by governments in emerging markets.", "themes":["Sciences économique, Évaluation des politiques publiques, Modèles économiques", "Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"The toroidal electromagnetic coupler has many advantages over the classical transformer. It is widely used in low-power applications. However, there are some limits that hamper its use in modern and high-power applications, such as the cost, the difficulty of winding and, especially, the limited number of studies carried out on the thermal aspect. In this article, we look at the problem of cooling a high-power and very compact toroidal electromagnetic coupler used in smart grid systems. The cooling is modeled thanks to heat transfer coefficients considering the windings as a surface heat source. A mathematical model which is quick and useful for a first approach is developed, and the results obtained show the temperature distribution for convective boundary conditions inside and outside the hollow torus. In addition, a parametric study is carried out. It aims to determine the optimal internal and external convective heat transfer coefficients for which the temperature of the coupler remains below the material’s destruction threshold. Additionally, a 3D numerical model taking into account the wires of the toroidal coupler is studied and compared with the mathematical model. The good consistency between the two methods ensures that this simplified thermal modeling can be trusted for the study of thermal management during the design of future electromagnetic couplers.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Several emerging battery technologies are currently on endeavour to take a share of the dominant position taken by Li-ion batteries in the field of energy storage. Among them, sodium-based batteries offer a combination of attractive properties i.e., low cost, sustainable precursors and secure raw material supplies. Na-based batteries include related battery concepts, such as Na-ion, Na-all-solid-state-batteries, Na/O2 and Na/S, that differ in key components and in redox chemistry, and therefore result in separate challenges and metrics. Na-ion batteries represent an attractive solution which is almost ready to challenge Li-ion technology in certain applications; the other cell concepts represent a more disruptive innovation, with a higher performance gain, provided that major hurdles are overcome. The present review aims to highlight the most promising materials in the field of Na-based batteries and challenges needed to be addressed to make this technology industrially appealing, by providing an in-depth analysis of performance metrics from recent literature. To this end, half-cell reported metrics have been extrapolated to full cell level for the more mature Na-ion technology to provide a fair comparison with existing technologies.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Road networks represented as a networked system of edges and nodes have raised considerable interest in the literature of networks, leading to numerous studies throughout the years. In these networks, the junctions where roads intersect are represented by nodes while the road segments connecting them represent the edges. Road networks in major cities and metropolises all over the world are very large-scale dense networks. Thus, the need to identify the most important roads that influence both vehicle and pedestrian flows, urban crime, collective dynamic behavior, land-use separation and retail vitality. In this context, in this paper, we propose a new method to extract the skeleton or the backbone of cities. The so-called 'Link Motif-Betweenness skeleton (LMB)' aims to select the links belonging to the larger number of motifs in the network and also having high betweenness. The LMB selects links separately from two sub-networks: from the local sub-network which is formed only from the intra-community links to select edges with a local influence in the various communities, and also from the global sub-network which is formed from the inter-community links of the network to select edges with a global influence all over the network. The proposed method is tested on road networks in the five largest cities of France: Paris, Marseille, Lyon, Toulouse and Nice. Experimental results show the efficiency of the LMB in terms of preserving relevant roads as compared to some alternative methods.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité", "Base et Traitement de données, IA"]},
{"abstract":"Actors of the Cooperative Intelligent Transport Systems (C-ITS) generate various amounts of data. Useful information on various issues such as anomalies, failures, road profiles, etc., could be revealed from the analysis of these data. The analysis, could be managed by operators and vehicles, and its output could be very helpful for future decision making. In this study, we collected real data extracted from road operators. We analyzed these streams in order to verify whether abnormal behaviors could be observed in the data. Our main target was a very sensitive C-ITS failure, which is when a road-side unit (RSU) experiences transmission failure. The detection of such failure is to be achieved by end users (vehicles), which in turn would inform road operators which would then recover the failure. The data we analyzed were collected from various roads in Europe (France, Germany, and Italy) with the aim of studying the RSUs’ behavior. Our mechanism offers compelling results regarding the early detection of RSU failures. We also proposed a new C-ITS message dedicated to raise alerts to road operators when required.", "themes":["Communications, Infrastructures et Connectivité", "Capteurs et Traitement du signal"]},
{"abstract":"Employing machine learning into 6G vehicular networks to support vehicular application services is being widely studied and a hot topic for the latest research works in the literature. This article provides a comprehensive review of research works that integrated reinforcement and deep reinforcement learning algorithms for vehicular networks management with an emphasis on vehicular telecommunications issues. Vehicular networks have become an important research area due to their specific features and applications such as standardization, efficient traffic management, road safety, and infotainment. In such networks, network entities need to make decisions to maximize network performance under uncertainty. To achieve this goal, Reinforcement Learning (RL) can effectively solve decision-making problems. However, the state and action spaces are massive and complex in large-scale wireless networks. Hence, RL may not be able to find the best strategy in a reasonable time. Therefore, Deep Reinforcement Learning (DRL) has been developed to combine RL with Deep Learning (DL) to overcome this issue. In this survey, we first present vehicular networks and give a brief overview of RL and DRL concepts. Then we review RL and especially DRL approaches to address emerging issues in 6G vehicular networks. We finally discuss and highlight some unresolved challenges for further study.", "themes":["Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"V2I communications complement V2V safety applications by dealing with emergency situations such as crash scenarios that the V2V program cannot handle or that could be addressed more effectively. However, depending on the deployed infrastructure, we can distinguish between three situations regarding allowed communications: infrastructure-based, infrastructure-less and intermittent infrastructure. We will focus in vehicular networks with an intermittent connectivity, where the unavailability of direct communication with RSUs poses huge problems, especially when vehicles have to send safety-related messages to the infrastructure. In fact, a scattered vehicular infrastructure leads to non-homogeneous coverage, especially in highway scenarios extending over long distances; it is very expensive to set up an infrastructure across the whole road. Our objective is to address the challenges related to safety information forwarding towards the RSU in such networks by enabling vehicles to make an optimal forwarding decision based on contextual information relative to the infrastructure and the neighbourhood. In this work, we present HyRSIC (Hybrid Routing for Safety data with Intermittent V2I Connectivity), a routing approach, combining geographical and topological routing, proposed to deal with data forwarding in intermittent infrastructure-based networks. We conducted an in-depth evaluation from three different perspectives: scalability, reliability and efficiency. The results show that HyRSIC is able to scale quickly and adapt promptly to density and speed variations. Compared to GPSR and its variant ILTS+GPSR, HyRSIC offers the best packet delivery ratio for sparse networks, 12-27% higher, and the lowest End-to-End delivery delay, 25-50% less.", "themes":["Capteurs et Traitement du signal", "Communications, Infrastructures et Connectivité"]},
{"abstract":"Modern vehicles contain already connected devices allowing them to interact with the road infrastructure and with other vehicles. The goal of this interaction is to share information and to improve road safety, traffic efficiency and driving comfort. The resulting system, called cooperative intelligent transport system (C-ITS), involves vehicles, infrastructure, and traffic management. Vehicles and infrastructure in development use a combination of cameras, sensors, GPS, radar, LiDAR, and on-board computers. These technologies work together to map the vehicle's position and its proximity to everything around it. Because of their reliance on these sorts of technologies, which are easily accessible to tampering, a driving system in this environment is susceptible to cyberattacks if an attacker can discover a weakness in a certain type of vehicle, infrastructure or in a company's electronic system. Since this environment is a critical system, these attacks can lead to disasters that eventually cost lives. After reviewing the state-of-the-art of C-ITS, examples of road safety using digital technologies will be presented, and the focus will deal with cybersecurity threats for connected vehicles. Such threats may concern the inside components of the vehicle or the communications between vehicles. Main challenges and future research directions will be discussed.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Many port authorities have developed ambitious strategies to foster hinterland intermodal transportation. In addition, port-centric logistics, that is, the provision of distribution facilities and value-adding activities in the port area, has expanded in multiple ports. Obviously, such port-centric logistics may impact the operations in the hinterland substantially and could potentially reduce opportunities for intermodal transport in the hinterland. We analyze the interaction between port-centric logistics and hinterland intermodal transportation. We take a logistics service provider’s perspective and we include some key elements in the model, such as detention fees, extra handling, transport efficiency and empty container repositioning. We develop new analytical results identifying the optimal market areas of truck-only transportation, port-centric logistics and hinterland intermodal transportation. Our results show that tension between port-centric logistics and hinterland intermodal transportation is quite likely to happen in practice. We additionally study the use of continental containers as a way to reconcile port-centric logistics and hinterland intermodal transportation and we derive further results. We illustrate our results via an example and we highlight managerial insights.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"With the use of microservices, many software solutions have been improved in terms of scalability, response efficiency, ease of load balancing among others. However, it is still a challenge to dynamically deploy them according to devices' heterogeneity and energy consumption concerns, while maintaining a defined QoS. Centralized and decentralized approaches that manage microservices deployment have the traditional pros and cons long discussed over time. While the former offer greater control over distributed application components, the latter offers frugal network negotiations, no system-wide crashes, privacy, among others. This work focuses on identifying 'ideal' host candidates for microservices' execution in a decentralized network, applying run-time scheduling operations (migration or duplication) to reduce energy consumption. To do this, we created a scheduling algorithm using MAAN (a P2P approach) to interpret a decentralized network as a multidimensional resource (capacity-demand) space, which supports range queries in a logarithmic quantity of hops. In this way, a node that runs a set of microservices is able to 1) map them in terms of their execution requirements (i.e. CPU frequency, RAM capacity, Network rate and disk speed) 2) Select an ideal microservice to be moved or duplicated, 3) find ideal node(s) that meet all those requirements in an optimal computational complexity and 4) negotiate the movement or duplication of the selected microservice, by analyzing energy consumption and QoS criteria.", "themes":["Base et Traitement de données, IA"]},
{"abstract":"The concept of a digital twin is increasingly appearing in industrial applications, including the field of predictive maintenance. A digital twin is a virtual representation of a physical system containing all data available on site. This paper presents condition monitoring of ventilation systems through the digital twin approach. A literature review regarding the most popular system faults is covered. The motor current signature analysis is used in this research to detect system faults. The physical system is further described. Then, based on the free body diagram concept and Newton’s second law, the equations of motion are obtained. Matlab/Simulink software is used to build the digital twin. The Concordia method and the Fast Fourier Transform analysis are used to process the current signal, and physical and numerical system current measurements are obtained and compared. In the final step of the modeling, specific frequencies were adjusted in the twin to achieve the best simulation. In addition, a statistical approach is used to create a complete diagnostic protocol.", "themes":["Base et Traitement de données, IA"]},
{"abstract":"Using a multi-level perspective approach combined with top-down macroeconomic models, we analyse the situation of the GCC countries in the perspective of a global transition to zero-net emissions before the end of the century. Based on these analyses we propose strategic and political options for these oil and gas exporting countries. We show that it would be unwise for GCC member states to adopt an obstruc-tionist strategy in international climate negotiations. On the contrary, these countries could be proactive in developing international emissions trading market and exploiting negative emissions obtained from CO 2 direct reduction technologies, in particular Direct Air Capture with CO 2 sequestration, and thus contribute to a global net-zero-emissions regime in which clean fossil fuels are still used.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"Multi-Access Edge Computing (MEC) architectures now seem to represent the future of data processing architectures. Indeed, they have the potential to optimize the use of the backhaul network, guarantee the implementation of real-time applications and offer services adapted to the user’s context. To further improve the performance of MEC architectures, it may be worth combining them with a new technology at the physical layer: Non Orthogonal Multiple Access (NOMA). During the task offloading process, this could enhance energy efficiency, maximize the number of users benefiting from MEC services and further reduce latency. That is why the article focuses on the use of NOMA for task offloading in MEC architectures and offers a comprehensive study on the subject. First, we define a taxonomy to ensure a systematic review of existing work. We then analyze and compare existing works, classifying them according to their purpose. Based on this, we then discuss the benefits and limitations of existing work, highlighting some good practices. Finally, we identify future research directions in the field of NOMA-assisted MEC architectures ", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"With the recent increase of the research community's attention, green software, also called sustainable software, has gained the spotlight as an opportunity for cutting back on the electrical energy expense world-wide. As a result, new approaches that cover the development, deployment, and execution of software have been garnered with the promise of a more efficient use of computational resources. Nevertheless, their adoption has been hindered by technicalities, and a lack of consistent guidelines from the analysis and design stages of the development. In this paper, we present RADIANCE: a proof of concept web app for designing greener software with a model-driven approach based on the Behavior-Based Consumption Profiles (BBCP) Domain-Specific Modeling Language. RADIANCE, in contrast to other tools, embraces users with different levels of knowledge on green software and the BBCP approach, simplifying green software design. Moreover, RADIANCE assesses and rates the energy consumption of the profiles generated by the user, assisting the user to identify possible design changes that promote the creation of greener software.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Base et Traitement de données, IA"]},
{"abstract":"Maritime transport is one of the main drivers of a country’s economic growth. Up to 90% of world trade is carried out by sea. However, the high consumption of fossil fuels leads to significant greenhouse gas emissions and other pollutants emissions, such as the nitrogen dioxide (NOx) and the sulfur oxides (SOx). Decarbonizing maritime transport, through the transition to electrified propulsion, is a major challenge for researchers and engineers in the naval construction sector. This paper studies electric, thermal and hybrid energy/propulsion solutions for ships serving the island of Ouessant, located near Brittany’s coast in France. Using a simplified methodology based on power flows between the various components (batteries, generators, fuel cells), the most suitable type of energy is investigated according to the case study, for efficient and effective vessel use. The simulations show that the energy consumption of the fully electric solution is the best with 5.78 MWh consumed against, for example, 13.89 MWh equivalent of fuel for the classic diesel topology.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"n this paper, we propose graph-based models for several vehicle routing problems with intermediate stops: the capacitated multi-trip vehicle routing problem with time windows, the multi-depot vehicle routing problem with inter-depot routes, the arc routing problem with intermediate facilities under capacity and length restrictions and the green vehicle routing problem. In these models, the set of feasible routes is represented by a set of resource constrained paths in one or several graphs. Intermediate stops are supported by the possibility to define negative resource consumption for some arcs. The models that we propose are then solved by VRPSolver, which implements a generic branch-cut-and-price exact algorithm. Thus, a simple parameterization enables us to use several state-of-the-art algorithmic components: automatic stabilization by dual price smoothing, limited-memory rank-1 cuts, reduced cost-based arc elimination, enumeration of elementary routes, and hierarchical strong branching. For each problem, we numerically compare the proposed methodology with the best exact approach found in the literature. State-of-the-art computational results were obtained for all problems except one.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité", "Base et Traitement de données, IA"]},
{"abstract":"This article deals with the detection of mechanical faults in synchronous machines from single current measurement at variable speed. The proposed approach is based on an order tracking method in which the analysis signal is sampled as a function of the mechanical angle. In this case, the spectral components become independent of the speed and the frequency analysis can be exploited. Order tracking is generally implemented from a position measurement. In this work we present a method that allows us to estimate this position and the analysis signal from only one current measurement. The proposed approach allows an intuitive adjustment of the algorithm parameters. Secondly, a statistical method is used to finalize the diagnosis. At variable speed, this type of method is difficult to implement and we show that order tracking makes it possible to simplify the analysis. The procedure is tested in simulation and on a experimental test bench.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Dropshipping, where e-retailers manage marketing and dropshippers manage inventory and fulfillment, has become a common practice in e-commerce. However, due to information asymmetry, some e-retailers require dropshippers to share available inventory quantity committed to them on a periodic basis (x-hour, day,...), via an availability commitment. Such commitment leaves the potential for dropshippers to overpromise and exploit availability pooling benefit as it does not involve physical transaction. To further prevent fulfillment failure, some e-retailers stop accepting more orders once remaining promised quantity falls below a promised availability threshold, which is unknown to the dropshipper. In this paper, leveraging the collaboration with a dropshipping furniture manufacturer in the US market, we tackle the inventory availability commitment (IAC) problem for dropshippers at the operational decision level. Three commitment policies are proposed based on varying overpromising allowance: guaranteed fulfillment, controlled fillrate, and penalty-driven fillrate policies. The IAC optimization problem, under uncertain customer demand and retailers threshold, is modeled as a two stage stochastic program. Experimental results on a case study demonstrated that penalty-driven fillrate policy is a dominating policy for a dropshipper under any availability level while the impact of overpromising is maximized under lean availability. E-retailers imposing thresholds tend to receive more availability than those not imposing any threshold in general. However, non-overpromising dropshippers with lean or lower availability level will promise less availability to e-retailers imposing threshold.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"In this paper, we evaluate the synergy between variable renewable energy (VRE), electric mobility, and Vehicle to Grid (V2G) deployment for a small community transitioning to a low-carbon economy. We propose an integrated deterministic modeling approach that accurately describes electric mobility activity within the electric grid in the ETEM-SG long-term capacity expansion model. This approach allowed us to keep the entire approach in the linear programming domain. We then perform a scenario analysis on the Isle of Pines case. The results show that V2G is essential for electric vehicles to make a positive contribution to the electric system by providing a supply–demand balance service. The deployment of electric vehicles allows reaching a VRE penetration rate of up to 94%, at no additional cost compared to a solution without electric vehicles, and even with a global-cost reduction of up to 5.3% thanks to a decrease of the capacity of stationary battery packs needed for storage.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"To address the climate emergency, France is committed to achieving carbon neutrality by 2050. It plans to significantly increase the contribution of renewable energy in its energy mix. The share of renewable energy in its electricity production, which amounts to 25.5% in 2020, should reach at least 40% in 2030. This growth poses several new challenges that require policy makers and regulators to act on the technological changes and expanding need for flexibility in power systems. This document presents the main strategies and projects developed in France as well as various recommendations to accompany and support its energy transition policy.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Smart Grids (SGs) constitute the evolution of the traditional electrical grid towards a new paradigm, which should increase the reliability, the security and, at the same time, reduce the costs of energy generation, distribution and consumption. Electrical microgrids (MGs) can be considered the first stage of this evolution of the grid, because of the intelligent management techniques that must be applied to assure their correct operation. To accomplish this task, sensors and actuators will be necessary, along with wireless communication technologies to transmit the measured data and the command messages. Wireless Sensor and Actuator Networks (WSANs) are therefore a promising solution to achieve an intelligent management of MGs and, by extension, the SG. In this frame, this paper surveys several aspects concerning the application of WSANs to manage MGs and the electrical grid, as well as the communication protocols that could be applied. The main concerns regarding the SG deployment are also presented, including future scenarios where the interoperability of different generation technologies must be assured.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Communications, Infrastructures et Connectivité", "Capteurs et Traitement du signal"]},
{"abstract":"This paper is about an integrated optimization approach for timetabling and rolling stock rotation planning in the context of passenger railway traffic. Given a set of possible passenger trips, service requirement constraints, and a fleet of multiple heterogeneous self-powered railcars, our method aims at producing a timetable and solving the rolling stock problem in such a way that the use of railcars and the operational costs are minimized. To solve this hard optimization problem, we design a mixed- integer linear programming model based on network-flow in an hypergraph. We use this models to handle effectively constraints related to coupling and decoupling railcars. To reduce the size of the model, we use an aggregation and disaggregation technique combined with reduced-cost filtering. We present computational experiments based on several French regional railway traffic case studies to show that our method scales successfully to real-life problems.", "themes":["Sciences économique, Évaluation des politiques publiques, Modèles économiques", "Base et Traitement de données, IA"]},
{"abstract":"Edge computing empowers service providers to deploy smart vehicles applications that require high throughput and extremely low latency. In this context, optimal Edge servers' placement becomes more difficult since it requires addressing several interrelated requirements at the same time, such as delay, deployment cost, and energy consumption. This paper studies optimal Edge server placement for energy efficiency. The proposed approach, called Green Optimal Edge Server Placement (GOESP), models the placement problem using integer linear programming to address the trade-off between latency, energy, and deployment cost while considering Edge servers' capacity and expected vehicle's traffic on the road. GOESP minimizes the energy consumption by minimizing the number of deployed Edge servers while meeting end-to-end communication latency and avoiding servers' overloading. We evaluate the efficiency of our approach mathematically and through simulations utilizing real-world traffic extracted from open data of Bordeaux city, France. The results demonstrate that our technique outperforms other methods in terms of energy efficiency and guarantees latency and workload balancing requirements.", "themes":["Capteurs et Traitement du signal", "Base et Traitement de données, IA"]},
{"abstract":"We experimentally study the unsteady forcing of the turbulent wake of a three-dimensional blunt body for drag reduction purposes. The forcing is provided by pulsed jets coupled to small flush-mounted curved surfaces and affects the dynamics of the shear layer at separation from the trailing edge of the model. The systematic analysis of the influence of various parameters (forcing frequency and amplitude, radius of curvature r of the surfaces, free-stream velocity U0) on the base drag reduction provides key ingredients to identify proper scaling laws of the mechanisms involved and to model them. The flow reattachment and separation on the curved surfaces result in a boat-tailing of the wake leading to drag reductions of up to 12% and are noticeably influenced by the time scale of unsteadiness of the forcing. For high frequencies of the order of O(U0/r), strong vortical coherent structures produced by the interaction between the pulsed jets and the separating shear layer promote the interaction of the flow with the curved surfaces. Moreover, the local curvature and pressure gradients across the separating shear layer in the vicinity of flow separation are noticeably modified to result in a further pressure drag reduction for a given forcing amplitude. A simple inviscid-flow model illustrates the peculiar induced effect of these coherent structures on the flow, which explains both the curvature effects leading to additional drag decrease and the saturation in drag decrease for increasing forcing amplitude. The results point to the need for careful combination between forcing frequency and size of the curved surfaces to achieve all the potential in drag reduction of the unsteady Coanda effect. The effort to propose scaling laws and models of the unsteady Coanda effect is a step towards implementing this control strategy at an industrial scale or on different fluid dynamics problems.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Nowadays, the deployment of vehicular communication networks appears as an efficient solution to improve both road users safety and road traffic efficiency. Indeed, vehicular networks could enable the deployment of Cooperative Intelligent Transport Systems (C-ITS). Thanks to C-ITS applications, vehicles could exchange information concerning, for example, road conditions or emergency braking. The operation of many C-ITS applications relies on an efficient geographical dissemination of data : cooperative downloading, obstacle detection, cooperative map creation, etc. So far, this geographical data dissemination has mainly been based on direct communication between vehicles (vehicle-to-vehicle). However, this approach faces limitations when data must be transmitted over large geographical areas : connectivity loss, packet loss, etc. In addition, in recent years, vehicular networks have evolved from an ad hoc approach to a centralized approach, integrating cellular communication technologies. Therefore, geographical data dissemination could be based on the cellular network, widely deployed and guaranteeing acceptable performance. Thus, in this thesis, we focused on the definition of an efficient and secure solution for cellular-based geographical data dissemination. To achieve that, first of all, we proposed an evolution of the current vehicular communication architecture. Thanks to the proposed improvements, the proper functioning of all C-ITS applications could be guaranteed. Then, we defined a solution, based on a Software Defined approach, to efficiently distribute data geographically. This approach overcomes the limitations of the protocol currently used for geographic data dissemination. Moreover, it guarantees an efficient management of the mobility of terminal devices. Finally, we introduced a new solution to secure software-defined vehicular networks. The proposed approach, using the Blockchain technology, aims to guarantee a high level of security and scalability.", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes", "Communications, Infrastructures et Connectivité"]},
{"abstract":"Urban logistics is a key step in distribution chains. It implies the use of trucks in congested areas, and generates numerous externalities (congestion, noise, pollution, etc.). Supply chain configurations and consumer behaviors are undergoing deep changes, with a significant increase in the intensity of urban logistics and a diversification of delivery channels within cities. This is an important challenge for city sustainability, as urban logistics is an essential economic activity, and yet the source of intense negative externalities. Numerous directions are currently being explored to rethink urban logistics, such as drones, cargo bikes, crowd logistics, and so forth. However, the economic and environmental relevance of these technologies is not yet perfectly clear. This paper focuses on the conditions for the financial sustainability of cargo bikes compared with electric light commercial vehicles (LCVs). The analysis is based on real data, provided by the parcel service company DB Schenker. The dataset consists of 600,000 operations made in Paris over two months. Operations with electric LCV are assumed to be identical to conventional LCV; the cost comparison is based on a total cost of ownership approach. Operations with cargo bikes assumes that eligible shipments are first brought to micro hubs within the city by electric LCV, then delivered by cargo bike. The numbers and locations of micro hubs are optimized. Results show that a cargo bike solution can be more cost-efficient than electric LCV with a few micro hubs located where the demand is densest, but they can only be relevant financially in those conditions.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Ensuring that an active path is provided at all times in a Wireless Sensor Network (WSN) is fundamental for securing the timely delivery of critical data and maintaining the quality of service required to effectively support delay-sensitive applications. In duty cycling mode, ensuring such a path becomes a real challenge as the activity scheduling of different nodes should be regulated and adjusted to provide a pipe-lined node activity from source to sink. Furthermore, some transmission delays may be incurred in waiting for a next-hop node to be awakened. The data transfer time is mainly influenced by the performance of both MAC and routing protocols; an inter-layer design allowing efficient coordination between the MAC and routing is then necessary to make the appropriate decisions relating to the selection of the next hop and the adjustment of the duty cycle. In this article, we provide a cross-layer multi-path routing approach designed to support the transfer of critical data over duty-cycled WSN networks. This approach establishes multi-node disjoint paths with complementary duty-cycling schedules to ensure the availability of an active path capable of transmitting critical data at all times. It relies on a tight cooperation between the routing and MAC layers in order to appropriately adjust and regulate the wake-up schedules of involved nodes in the forwarding phase. We analytically proved the correctness of the proposed scheduling adjustment rules. We conducted extensive simulations to show the ability of the CL-NDRECT to provide a viable trade-off between energy conservation and real time responsiveness. Simulation results show that CL-NDRECT provides around 65% cumulative energy saving during route establishment and data transfer compared to the always-on multipath approach at the cost of around 10% increase in response time.", "themes":["Capteurs et Traitement du signal"]},
{"abstract":"As research into innovative forms of automated transportation systems gains momentum, it is important that we develop an understanding of the factors that will impact the adoption of these systems. In an effort to address this issue, the European project CityMobil2 is collecting data around large-scale demonstrations of Automated Road Transport Systems (ARTS) in a number of cities across Europe. For these systems to be successful, user acceptance is vital. The current study used the Unified Theory of Acceptance and Use of Technology (UTAUT) to investigate the factors which might influence acceptance of ARTS vehicles, which were operational in two locations in Europe. The results indicate that the UTAUT constructs of performance expectancy, effort expectancy and social influence were all useful predictors of behavioural intentions to use ARTS, with performance expectancy having the strongest impact. However, it would appear that other factors are also needed in order for the model to strongly predict behavioural intentions in an automated transport context. Based on these findings, a number of implications for developers and ideas for future research are suggested.", "themes":["Géographie, Territoires et Sociologie"]},
{"abstract":"Several Hard carbon||Na3V2(PO4)2F3 full-cells in 18650-format are assembled to demonstrate the possible use of SIBs in stationary applications. The cell aging process is investigated in two different conditions: (i) continuous cycling at different current rates, and (ii) storage at different states-of-charge at various temperatures. The obtained results reveal that the cell degradation depends strongly on the temperature, current rates applied in cycling conditions, or state-of-charge of the storage test. Under cycling conditions, the continuous sodiation/desodiation may induce significant mechanical deformation, leading to the detachment of active materials from the current collector. Furthermore, the post-mortem analysis shows that reaction rate and aging process are not homogeneous along the electrode roll. The XRD analysis shows that Na3V2(PO4)2F3 structure is robust; nevertheless, the material cannot recover the initial Na⁺ content as the cycling progresses, which is the main cause for capacity loss in the positive electrode. The solid-electrolyte interphase present on the hard carbon surface was characterised using XPS. The hard carbon electrode cannot be detected during this study, evidencing the formation of a relatively thick (>5 nm) passivating layer composed of carbonate salts and NaF, which are the main products of electrolyte decomposition.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Due to the increasing number of vehicles in circulation in different urban cities, several automatic traffic monitoring systems have been developed. In particular, traffic monitoring systems using roadside cameras are becoming extensively deployed, as they offer imperative technological advantages compared with other traffic monitoring systems. Vehicle detection and traffic congestion classification are two main steps for video-based traffic congestion detection systems; the associated methods have a deep impact on the performance of the whole system. In this paper, we investigate four selected vehicle detection methods namely Gaussian Mixture Model (GMM), GMM-Kalman filter, Optical Flow, and ACF object detector in two contexts: urban and highway. Three traffic congestion classification methods are also studied. The comparative study of the different methods allows us to choose the most appropriate ones to be integrated in the framework proposed to solve the traffic issues in the bridge of Bizerte.", "themes":["Capteurs et Traitement du signal", "Base et Traitement de données, IA"]},
{"abstract":"To manage a growing number of users and an ever-increasing demand for bandwidth, future 5th Generation (5G) cellular networks will combine different radio access technologies (cellular, satellite, and WiFi, among others) and different types of equipment (pico-cells, femto-cells, small-cells, macro-cells, etc.). Multi-connectivity is an emerging paradigm aiming to leverage this heterogeneous architecture. To achieve this, multi-connectivity proposes to enable UE to simultaneously use component carriers from different and heterogeneous network nodes: base stations, WiFi access points, etc. This could offer many benefits in terms of quality of service, energy efficiency, fairness, mobility, and spectrum and interference management. Therefore, this survey aims to present an overview of multi-connectivity in 5G networks and beyond. To do so, a comprehensive review of existing standards and enabling technologies is proposed. Then, a taxonomy is defined to classify the different elements characterizing multi-connectivity in 5G and future networks. Thereafter, existing research works using multi-connectivity to improve the quality of service, energy efficiency, fairness, mobility management, and spectrum and interference management are analyzed and compared. In addition, lessons common to these different contexts are presented. Finally, open challenges for multi-connectivity in 5G networks and beyond are discussed. ", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"We present the concept of relay attacks, and discuss distance-bounding schemes as the main countermeasure. We give details on relaying mechanisms, we review canonical distance-bounding protocols, as well as their threat-model (i.e., covering attacks beyond relaying) stemming from the authentication dimension in distance bounding. Advanced aspects of distance-bounding security are also covered. We conclude by presenting what we consider to be the most important challenges in distance bounding.", "themes":["Communications, Infrastructures et Connectivité", "Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"In this article, we propose to determine the dynamic model of a squirrel-cage induction motor from a reduced amount of information. An adaptive observer is also built from this model in order to obtain a speed estimation and to perform rotor fault monitoring by Tacholess Order Tracking (TOT). We also propose a generalization of the notion of angular sampling in order to adapt to this type of defect. The procedure is validated in the laboratory on a test bench dedicated to the study of rotor bar defects.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Sparse Code Multiple Access (SCMA) is one of Non Orthogonal Multiple Access (NOMA) candidates for 5G, the fifth generation mobile network. Multiple overlapped blocks of SCMA code are transmitted per frequency layer which compels the receiver to cancel unwanted SCMA code blocks. Thanks to the sparsity of SCMA, Message Passing Algorithm (MPA) achieves near-optimal performance. Nevertheless, this process is time-consuming and has a high degree of complexity even if Max-Log Algorithm is used. The major contribution of this paper is to propose a new decoding scheme called Hybrid Interference Cancellation (HIC) to reduce time processing without degrading a target Bit Error Rate (BER). The HIC decodes and removes the strongest user, reducing the complexity of Log Domain MPA decoding of remaining users, followed by a Low Density Parity Code (LDPC) decoder. The interference cancellation decoder is either a hard interference cancellation or a soft interference cancellation. The originality of the paper is to calculate a threshold value based on power measurements to decide whether hard decoder or soft decoder should be used to reach the BER target with a lower complexity. Results show a significant reduction in terms of complexity as compared to the traditional MPA process for the same values of BER.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"The strong development of solid-state power sources offers numerous benefits (such as higher operating frequencies and reduced switching times and power losses), but contributes inherently to the extended range of electromagnetic interferences (EMI). As these systems are associated with a set of embedded monitoring devices using low amplitude signals, it becomes necessary to consider new critical cases of electromagnetic (EM) immunity correlated to such environments. The most common solution against aggressive radiated EMI is the metallic enclosure, which brings a strong shielding effectiveness (SE), but is it always the best compromise? Our study in this paper is focused on the SE of multilayer designs and is therefore intended to optimize the enclosures’ compactness for board level shielding (BLS) on printed circuit boards (PCB). First, results are presented, based on metallic multilayer shielding theory and parametric numerical studies in the intentional electromagnetic interferences (IEMI) frequency range, from 0.2 to 5 GHz. Then, a complete 3D EM co-simulation model using the microwave and design modules of CST Studio Suite (which includes the subject, the EMI radiating source, and the multilayer shielding) is proposed, with emphasis on the pertinent choices regarding layers width and their arrangement for compact EM shielding and immunity optimization.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"With the advent of Internet of Vehicles, overhead related to localization services and path discovery step can drain the network resources and overload the large-scale vehicular networks, thus slowing down the routing process, especially with the recent surge of time-sensitive and QoS (Quality of Service) greedy applications. Performing proactively these tasks contributes to reducing the associated overhead by exploiting the vehicular beaconing system, as related data can be piggybacked with beacon messages. In this context, we present ILTS, an Infrastructure Localization service and Tracking Scheme, designed to supply vehicles with contextual information about the infrastructure accessibility and the neighborhood, in order to track available paths and to forward promptly safety and non-safety-related information. Through extensive simulation experiments, we have proven the ability of ILTS to promptly supply vehicles with fresh information about the location of the infrastructure and the availability of paths to reach it. The obtained results show that the vehicles are able to maintain knowledge of full paths towards the infrastructure during an average of 90% of the time spent in an uncovered area.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"Currently, there is serious political support for the decarbonization of transport locally, nationally and even internationally. Public transport operators are focusing on the use of electric buses as an opportunity to reduce greenhouse gas emissions and improve air quality. However, using electric buses requires a functional infrastructure of urban charging points. Fast-charging can be made available thanks to the progress made on the major technological charging devices in recent years. In this study, we consider an optimization problem of the design of an infrastructure for a fast-charge city electric bus service. The decisions which have to be made include determining a mixed fleet of conventional and electric buses, points for electric chargers and power stations, quantities of charging plug devices, a distribution of electric buses between the routes, and matching chargers with power stations. The objective is to maximize the route-weighted total passenger capacity of electric buses. An Integer Linear Programming model has been developed to complement the existing non-linear model. The new model is efficient if the number of possible charging spots is small, which is natural and frequent in practice. Extensive computer experiments demonstrate that our approach delivers near-optimal solutions of the studied problem in ten minutes for real-world instances on a standard PC and it outperforms the earlier approach on every instance. ", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"Vehicle-to-Everything (5G-V2X) communications will play a vital role in the development of the automotive industry. Indeed and thanks to the Network Slicing (NS) concept of 5G and beyond networks (B5G), unprecedented new vehicular use-cases can be supported on top of the same physical network. NS promises to enable the sharing of common network infrastructure and resources while ensuring strict traffic isolation and providing necessary network resources to each NS. However, enabling NS in vehicular networks brings new security challenges and requirements that automotive or 5G standards have not yet addressed. Attackers can exploit the weakest link in the slicing chain, connected and automated vehicles, to violate the slice isolation and degrade its performance. Furthermore, these attacks can be more powerful, especially if they are produced in cross-border areas of two countries, which require an optimal network transition from one operator to another. Therefore, this article aims to provide an overview of newly enabled 5G-V2X slicing use cases and their security issues while focusing on cross-border slicing attacks. It also presents the open security issues of 5G-V2X slicing and identifies some opportunities. ", "themes":["Communications, Infrastructures et Connectivité", "Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"Remote and virtual centers have been studied for the past twenty years as an alternative to the traditional air traffic control tower environment. Designing such complex sociotechnical systems requires a systems engineering approach that appropriately integrates the human element as well as the technological and organizational components. In this paper, we identify the challenges of implementing this human-systems integration in the design of complex systems. We present the feedback we obtained from a series of semi-structured interviews with people involved in the development of military air traffic solutions. The participants' responses helped us establish methodological guidelines for designing and building a disruptive remote and virtual air traffic control center. We discuss how virtualized human- in-the-loop simulations in particular should help designers analyze user activity and be more flexible in system acquisition.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Multiaccess edge computing (MEC) has emerged as a promising technology for time-sensitive and computation-intensive tasks. However, user mobility, particularly in vehicular networks, and limited coverage of Edge Server result in service interruptions and a decrease in Quality of Service (QoS). Service migration has the potential to effectively resolve this issue. In this paper, we investigate the problem of service migration in a MEC-enabled vehicular network to minimize the total service latency and migration cost. To this end, we formulate the service migration problem as a Markov decision process (MDP). We present novel contributions by providing optimal adaptive migration strategies which consider vehicle mobility, server load, and different service profiles. We solve the problem using the Double Deep Q-network algorithm (DDQN). Simulation results show that the proposed DDQN scheme achieves a better tradeoff between latency and migration cost compared with other approaches.", "themes":[ "Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"Long-Range Wide Area Network (LoRaWAN) is a rapidly expanding communication system for Low Power Wide Area Network (LPWAN) in the Internet of Things (IoTs) deployments. It employs an Adaptive Data Rate (ADR) scheme that optimizes data rate, airtime, and energy consumption. Recently, the use of Network Slicing (NS) in LoRaWAN networks is being widely studied and a hot topic for the latest research in the literature. Network resources must be efficiently assigned to IoT devices in an isolated manner in order to handle and support specific Quality of Service (QoS) requirements for each slice. However, in dense LoRaWAN networks, the ADR scheme is insufficient for efficient resource allocation to meet the QoS requirements of each slice. In this article, we propose a DRL-based approach for intra-slicing resource allocation in dense LoRaWAN networks. In each slice, we implemented multi-agent DRL that allocates Spreading Factor (SF) and Transmission Power (TP) to IoT devices to meet QoS requirements, i.e. we replaced the conventional ADR scheme with multi-agent DQN with different reward function design for each slice according to QoS requirements. Experimental results realized in real conditions show that our approach outperforms the existing ADR scheme for all the slices.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"The impact of fluidic actuation on the wake and drag of a three-dimensional blunt body is investigated experimentally. Jets blowing tangentially to the main flow force the wake with variable frequency and amplitude. Depending on the forcing conditions, two flow regimes can be distinguished. First, in the case of broadband actuation with frequencies comprising the natural wake time scale, the convection of the jet structures enhances wake entrainment, shortens the length of the recirculating flow and increases drag. Secondly, at higher actuation frequencies, shear-layer deviation leads to fluidic boat tailing of the wake. It additionally lowers its turbulent kinetic energy thus reducing the entrainment of momentum towards the recirculating flow. The combination of both mechanisms produces a rise in the base pressure and reduces the drag of the model. Both actuation regimes are characterized by complementary velocity, pressure and drag measurements at several upstream conditions and control parameters. By adding curved surfaces to deviate the jets by the Coanda effect, periodic actuation is reinforced and drag reductions of approximately 20 % are achieved. The unsteady Coanda blowing not only intensifies the flow deviation and the base pressure recovery but also preserves the unsteady high-frequency forcing effect on the turbulent field. The present results encourage further development of fluidic control to improve the aerodynamics of road vehicles and provide a complementary insight into the relation between wake dynamics and drag.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"The purpose of this article is to propose a method for investigating the influence of the impulse voltage waveform generated by inverters based on wide bandgap semiconductors on the insulation endurance of magnet wires. In this regard, endurance tests of enamel insulation are performed on a designed test bench, which generates repetitive voltage pulses with ns-level rising and falling times corresponding to modern silicon carbide-based inverters. Furthermore, we suggest a novel specimen’s shape for testing enameled rectangular section magnet wires which find their application in electric traction motors. Considerations related to the deterioration of dielectrics subjected to impulse voltage with high slew rates and high switching frequency are given. ", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"A bi-frequency open-loop control strategy aiming to combine both high- and low-frequency forcing effects is used to experimentally reduce the drag of a simplified car model at a slight yaw angle of 5∘. The unforced mean wake features a lateral asymmetry which induces a low base pressure footprint close to the leeward side and increases drag compared to the aligned model. Forcing is performed with pulsed jets along the windward trailing edge. High-frequency forcing acts as a time-invariant flap. The fluidic flap effect deviates the windward shear layer towards the leeward side and reduces the wake bluffness, but the lateral asymmetry of the near wake is still observed. The drag reduction related to this high-frequency forcing is about 6% with a high actuation efficiency. A modulation of the high-frequency forcing with a low-frequency component is then introduced in order to modify the mass and momentum exchange in the separating shear layer at the windward trailing edge. We find that the modulated forcing provides the ability to manipulate the mean wake orientation while maintaining the fluidic flap effect. Among all wake orientations, those reducing drag are the ones having a mean symmetric wake. The bi-frequency control strategy leads to a maximum drag reduction of 7% for the best choice of frequencies. Importantly, the bi-frequency control is more efficient than the single high-frequency forcing, the actuator requiring only half the actuation energy and presenting an actuation efficiency multiplied by 3. Finally, the physical mechanisms related to drag reduction are carefully analyzed. In particular, we show that the wake symmetrization reduces the global production of turbulent kinetic energy in the shear layers. These results open up opportunities for closed-loop control of wake asymmetries.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Last-mile logistics is regarded as an essential yet highly expensive component of parcel logistics. In dense urban environments, this is partially caused by inherent inefficiencies due to traffic congestion and the disparity and accessibility of customer locations. In parcel logistics, access hubs are facilities supporting relay-based last-mile activities by offering temporary storage locations enabling the decoupling of last-mile activities from the rest of the urban distribution chain. This paper focuses on a novel tactical problem: the dynamic deployment of pooled storage capacity modules in an urban parcel network. It formulates the problem as a two-stage stochastic optimization model with recourse, and incorporates the synchronization of underlying operations through continuum approximation-based travel time estimations. It also develops a solution approach based on a rolling horizon algorithm with lookahead, sample average approximation and Benders decomposition enhanced by acceleration methods, able to solve large scale instances of a real-sized megacity. Numerical results, inspired by the case of a large parcel express carrier, are provided to evaluate the computational performance of the proposed approach and suggest up to 28% last-mile cost savings and 26% capacity savings compared to a static capacity deployment strategy.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"This paper investigates changes in European container port rankings, in order to determine if and how a new dynamic phase can follow a phase of maturity in a container port range. We examine mobility in ranking during 2000–2019 and shed light on the influence of neighbouring ports in a range as well as the level of maturity of each range. Findings from three different methods (Gini coefficient and the Lorenz curve; Markov chains; Spatial Markov Chains) show that, overall, there is a low probability for ports to change status and to enter into a new dynamic phase. Our results confirm that path dependence plays an important role in port systems, with very low inter-class mobility. When mobility occurs, it is mostly for small and medium ports, and this mobility is higher when ports are surrounded by large ports. These results suggest that competition with existing larger ports can be good for the port system rather than allowing traffic to concentrate in a small number of ports. Finally, mature port ranges can enter a renewed dynamic phase, as smaller ports seek either to compete for market share or alternatively seek mergers with large ports where competition possibilities are absent.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"The Routledge Handbook of Urban Logistics offers a state-of-the-art, comprehensive overview of the discipline of urban and city logistics. The COVID-19 pandemic and the rise in internet shopping in particular have placed new demands on urban logistics which require innovative technological and policy responses. Similarly, the necessity for sustainable urban logistics offers both a challenge and opportunity for development and seeks to address traffic congestion, local air quality, traffic-related degradation, the use of energy, safety aspects and noise. Featuring contributions from world-leading, international scholars, the chapters examine concepts, issues and ideas across five topic areas that reflect the increasingly diverse nature of current research and thinking in urban logistics: transport modes, urban logistics sectors, technical analysis, policy, and sustainability. Each chapter provides an overview of current knowledge, identifies issues and discusses the relevant debates in urban logistics and the future research agenda. This handbook offers a single repository on the current state of knowledge, written from a practical perspective, utilising theory that is applied and developed using real-work examples. It is an essential reference for researchers, academics and students working in all areas of urban logistics, from policy and planning to technology and sustainability, in addition to industry practitioners looking to develop their professional knowledge.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Cooperative Intelligent Transport Systems (C-ITS) are becoming indispensable in improving road safety and traffic management. ITS-G5 is the European standard for vehicle to everything (V2X) communications. With advanced V2X applications and use cases, the need for enhanced communication performance and broader perception of the road becomes crucial, particularly in congested areas, where the communication performance decreases significantly. Network slicing is a new network paradigm for next-generation networks. It has proved useful to guarantee the quality-of-service requirements of various applications. This paper presents an end-to-end network slicing for the ITS-G5 vehicular communications where slices' resources are orchestrated on all the ITS infrastructure, including the ITS-G5 radio access network. The proposed slicing mechanism aims to provide enhanced end-to-end (E2E) latency for specific traffic types and user groups. We demonstrate the slicing mechanism's effectiveness on two different priority groups carried in two different slices (i.e., lower-priority slice and higher-priority slice). Simulation results show a significant improvement of the E2E latency for users of the higher-priority slice.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"Battery-electric heavy-duty trucks (BEHDTs) offer significant carbon savings compared to diesel trucks, yet they pose certain challenges with regard to their range and charging needs. As the takeup is extremely low, representing around 1% of new sales, the motivation of this paper is to investigate how this takeup can be accelerated. The research gap analysed is to explore the potential for BEHDTs for pre-and post-haulage (PPH) of containers to and from an intermodal terminal, as the relatively short distances and regular returns to a central location may be well suited to ameliorate the challenges of BEHDTs. Previous authors have studied the potential of BEHDTs based on assumptions and simulations, and they have noted the need for empirical studies. This paper aims to fill that gap using empirical data collected from an entire fleet of 21 trucks serving a terminal over a full year. The distances, loads and stopping times are evaluated against the parameters of the current generation of BEHDTs with battery capacity around 400-500 kWh. Results show that it would be possible to switch at least 50% of trips to BEHDTs immediately, saving approximately 13,000 t of CO 2 annually at this one location, and this figure could rise to 75% in a couple of years as battery capacity increases and more fast chargers are available. The study concludes that the PPH intermodal container market is ideal for early adoption of BEHDTs, due to the short-medium distances per trip, several round trips to and from the terminal where the chargers are located, and sufficient waiting time during loading and unloading to charge the vehicles without impacting on vehicle productivity.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité", "Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Human-systems integration (HSI) denotes a possible evolution of two disciplines, that are Human Factors and Ergonomics (HFE) and Human-Computer Interaction (HCI), that led to Human-Centered Design (HCD), more specifically within the field of Systems Engineering (SE). HSI pragmatically considers the Technology, Organizations, and People (TOP) Model that supports integration of Technology, Organizations, and People during the whole life cycle of a system. HSI is inherently multi-agent, takes the system approach, and looks for the elicitation of emergent systemic properties through human-in-the-loop simulations (Virtual HCD). Human and machine are represented as systems defined by their structures and functions, which are characterized using the “context-resource orthogonality” framework. This encyclopedia entry provides HSI psychological and sociotechnical foundations, based on a nonlinear and self-organizing system perspective that departs from the traditional linear reductionist approach in psychology and engineering. This HSI epistemological endeavor addresses concepts such as separability, familiarity, emergence, tangibility, agonist-antagonist processes, symbiotic cognitive, and physical structures and functions.", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"Hydrogen is an energy carrier that will certainly make an important and decisive contribution to the global energy transition and lead to a significant reduction in greenhouse gas (GHG) emissions over the coming decades. It is estimated that 60% of GHG emission reductions in the last phase of the energy transition could come from renewables, green hydrogen and electrification based on green energy development. Coordinated efforts by governments, industry and investors, as well as substantial investment in the energy sector, will be required to develop the hydrogen value chain on a global scale. This paper summarizes the technical and technological advances involved in the production, purification, compression, transportation and use of hydrogen. We also describe the roadmaps and strategies that have been developed in recent years in different countries for large-scale hydrogen production.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"The CityMobil2 project produced an evaluation framework for the ARTS, in order to provide evidence as to the credibility, form and implementation strategy for ARTS from a series of demonstrations. The evaluation framework has led to the building of blocks of knowledge that are sufficient to move to larger deployments that will test the ARTS as part of a comprehensive approach to a more sustainable transport. The evolution of the ARTS vehicles over the course of the project has been considerable, and the next stage of deployment should enable the full benefits to be quantified. In this chapter, the main results of the three CityMobil2 large-scale demonstrations (La Rochelle, Trikala and Lausanne) and three small-scale demonstrations (Oristano, Vantaa and San Sebastián) are reported, based on the guidelines provided by the evaluation framework.", "themes":["Géographie, Territoires et Sociologie"]},
{"abstract":"France's national state-owned railway company (SNCF) plans to introduce the Automated Train Operation (ATO) system in manually operated trains to make train operations more efficient, eco-friendly, and precise. Preliminary Risk Analysis of ATO have been conducted at SNCF, but they are theoretical and have not been validated by human-in-the-loop simulation. As a contribution to the state of the art, we propose to use the PRODEC method to achieve a safety-orientated human-centered and organization-centered design, requiring the development of appropriate scenarios, which constitutes the object of this paper. To this end, our methodology and results are based on i) the analysis and categorization of the incidents that occurred within SNCF during the past years, including their classification, occurrence, and severity; ii) expert judgment. By doing so, we aim to define the human and organizational factors, as well as the technical elements that significantly impact system safety. The ten most relevant scenarios were developed. ", "themes":["Sciences cognitives, Interfaces H/M"]},
{"abstract":"This chapter presents the MUST-B model based on a systemic modeling that aims to address some of the future challenges of the smart cities. MUST-B stands for “Integrated Modeling of Land-Use – Transport for application in the Bordeaux agglomeration” and is funded by the Region Nouvelle Aquitaine. MUST-B is based on systemic land-use/transport modeling about how the land and property markets operate, and the interdependent factors for selecting the locations of households and employment. MUST-B is an agent-oriented model which simulates household and job location choices. It is based on an auction mechanism that models competition between agents in the real estate market (existing property holdings, including residential, industrial, and tertiary) and in the land property market (from buildable land reserves) over a given timeframe. This auction procedure is based on maximizing the utility provided to the agent by a given location: housing for a household and an area for business activity for employment premises. Utility is a function of several characteristics relating to the space and premises occupied, such as accessibility, surface area, energy quality of the building, notoriety, agglomeration effects and taxes, or property prices, the latter being endogenous. In this chapter, the mechanisms and functioning of the land property and real estate markets, which prevail in MUST-B, are presented. Methodological choices and behavioral guidelines for agents (households/workplaces) are also set out.", "themes":["Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"The subject of this work is an integrated optimization approach for timetabling and rolling stock rotation planning in the context of passenger railway traffic. Our approach is based on a hypergraph based integer programming model, which can handle trains composed of multiple heterogeneous self-powered railcars. The method aims at producing a timetable and solving the rolling stock problem given a set of possible passenger trips, a service requirement and a fleet of self-powered railcars. The produced timetable optimizes the production cost and especially the use of railcars. To solve our optimization problem, we use a minimum cost flow problem in a time/space/configuration hypergraph network. These models are used to handle effectively constraints related to coupling and decoupling railcars. To reduce the size of the generated model, we propose a reduced-cost fixing method based on a surrogate relaxation of the flow constraints. This relaxation allows to produce a relaxed model with a similar structure, but significantly less variables and constraints. We are able to produce both lower and upper bounds for the initial problem. These bounds allow to apply implicitly reduced-cost fixing techniques to the initial model. The obtained reduced version of the initial model is then solved by an MIP solver. We present some results based on several French regional railway traffic case studies to show that our methods scales to real-life problems.", "themes":["Base et Traitement de données, IA"]},
{"abstract":"The development of the new embedded and on roadside technologies, regardless of traffic type and driving area, have the potential to improve the traffic safety, to minimize the energy consumption, to reduce the pollution emissions, and to optimize the traffic performances. Moreover, the new mobility means have the capability to improve the equitability and allow a mobility access to disabled people. These benefits, however require well thought out implementation of the new services and functions in societies with minimum negative side effects. Thus, connected and automated vehicles (CAVs) offer a substantial potential to improve the operations and safety of transportation systems. However, the use of connectivity in CAVs introduces new risks in terms of safety. Indeed, CAVs involve the use of vehicle to vehicle (V2V) and vehicle to infrastructure (V2I) communications. These communications open additional system access points compared to traditional systems. These access points would make the mobility means and their technologies (embedded and on roadside) more vulnerable to specific attacks and could increase the impact of such cyberattacks. ", "themes":["Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes", "Communications, Infrastructures et Connectivité"]},
{"abstract":"In order to reduce our dependence on fossil fuels, alternative energy production and storage methods are being actively pursued. Hydrogen, as an energy carrier, has been studied extensively for its applications to achieve this objective. This paper presents a case study for hydrogen generation and storage, and its further application in hydrogen-based local e-mobility on an island named Ouessant in France. Since hydrogen-based mobility has been the focus of latest research, the study in this paper proposes a first of its kind mobile hydrogen refueling station in France. The mobile refueling station comprises of several novel technologies, where the anion exchange membrane (AEM) electrolyser results in a more stable and reliable performance. Moreover, it suffers from lower degradation as compared to alkaline based electrolysers. Accordingly, the proposed mobile hydrogen station is highly versatile and can be adapted to operate on various renewable energy resources to ensure reduced dependence on fossil fuel-based systems. The refuelling station uses novel electrochemical compression methods to compress hydrogen to very high pressures. Due to compression being electrochemical, as opposed to mechanical, there is less wear and tear in the system which ensures long lifetime of the equipment, which also results in lower energy consumption for compression. The initial results show that such system is highly suitable for remote applications where other forms of hydrogen production and supply are not suitable.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Achieving a sustainable delivery of goods in urban areas has become a challenging task for service providers and logistics managers. Under this context, the physical internet (PI) Manifesto offers through its emergent concept of interconnected city logistics (ICL) a solution toward a more sustainable transportation of PI containers within cities. In this article, we explore the operational urban transportation problem of PI containers under ICL considerations. For this variant, built on the multiplicity of urban logistics centres and their interconnection, a comprehensive modelling approach is proposed to include key features such as multiple time periods, multi-zone urban coverage, heterogeneous fleets, multi-trip and multi-hub pickups, and delivery constraints. In order to deal with solvability issues encountered with realistic instances of the problem, a heuristic solution approach is developed. This is done with the objective to come up with solutions offering the best trade-offs between economic and ecological attributes within a short computational time. To validate the approach, a realistic set of instances is built with data inspired from city freight movements in an urban area in France. Using these experiments, the solvability of the model and the performance of our heuristic approach are discussed and managerial insights are derived.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"Cooperative intelligent transport systems rely on a set of Vehicle-to-Everything (V2X) applications to enhance road safety. Emerging new V2X applications like Advanced Driver Assistance Systems (ADASs) and Connected Autonomous Driving (CAD) applications depend on a significant amount of shared data and require high reliability, low end-to-end (E2E) latency, and high throughput. However, present V2X communication technologies such as ITS-G5 and C-V2X (Cellular V2X) cannot satisfy these requirements alone. In this paper, we propose an intelligent, scalable hybrid vehicular communication architecture that leverages the performance of multiple Radio Access Technologies (RATs) to meet the needs of these applications. Then, we propose a communication mode selection algorithm based on Deep Reinforcement Learning (DRL) to maximize the network's reliability while limiting resource consumption. Finally, we assess our work using the platooning scenario that requires high reliability. Numerical results reveal that the hybrid vehicular communication architecture has the potential to enhance the packet reception rate (PRR) by up to 30% compared to both the static RAT selection strategy and the multi-criteria decision-making (MCDM) selection algorithm. Additionally, it improves the efficiency of the redundant communication mode by 20% regarding resource consumption.", "themes":["Communications, Infrastructures et Connectivité", "Base et Traitement de données, IA"]},
{"abstract":"This study is aimed at developing a low cost lumped model for simulating a Li-ion battery pack with thermal management systems (TMS) under continuous charging/discharging cycles. The considered system is composed of twenty-four commercial Li-ion batteries with phase change material (PCM) and nine aluminium tubes for liquid coolant circulation. A zero-dimensional numerical model is developed based on the transient energy balances and the analogy between heat transfer and electrical transfer using resistances and capacitors. The simulations were carried at 3-C discharging/0.5-C charging rates and obtained results were compared with both three-dimensional computational fluid dynamic (CFD) results and experimental results from the literature. The effect of various system design and operating characteristics such as the cooling method, the coolant temperature and its velocity, the number of coolant pipes and the ambient conditions on the system performance were presented and analysed. Results show that combining both PCM and liquid cooling for battery thermal management leads to reduce the maximal battery temperature by about 38 °C and 4 °C compared to natural convection thermal management mode and to passive PCM thermal management mode, respectively. Increasing the number of cooling pipes improves the performance of the system and its optimal number in this system is up to 9 pipes. The maximal battery cells temperature is reduced from 31 °C to 20 °C as the used liquid coolant inlet temperature is reduced from 25 °C to 10 °C. Finally, the suggested low cost lumped model is a promising tool for simulating, designing and optimising battery pack with thermal management systems under real exploitation conditions.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"Humanitarian supply chains (HSCs) contribute significantly to achieving effective and rapid responses to natural and man-made disasters. Though humanitarian organizations have during the last decades made considerable efforts to improve the response to crises in terms of effectiveness and efficiency, HSCs are still faced with so many challenges, one of which is the incorporation of sustainability dimensions (economic, social and environmental) in the management of their supply chains. In the literature, some authors have highlighted that the planning and achievement of sustainability performance objectives in humanitarian operations is hindered by the lack of decision support systems (DSS). Therefore, this paper proposes a multi-objective Master Planning DSS for managing sustainable HSCs. This Master Planning DSS includes: (1) the definition of a set of metrics for measuring the performance of a sustainable HSC; (2) an algorithm to solve the multi-objective problem; and (3) a Master Planning mathematical model to support the tactical planning of the sustainable HSC. Using the information gathered from field research and the literature, an illustrative numerical example is presented to demonstrate the implementation and utility of the proposed DSS. The results show that the order in which the three sustainability dimensions (economic, social and environmental) are prioritized has some impact on the performance measures. Therefore, it is important to fix a tolerance that would enable to obtain an acceptable balance (trade-off) between the three sustainability objectives, in line with the prioritization choice of the decision maker.", "themes":["Marketing, Durabilité, Chaine d’approvisionnement, Logistiques, Inter & Multimodalité"]},
{"abstract":"During the last decade, the smart grid (SG) concept has started to become a reality, mainly thanks to the technical progress achieved in telecommunications, informatics and power electronics, among other domains, leading to an evolution of the traditional electrical grid into an intelligent one. Nowadays, the SG can be seen as a system of smart systems that include cyber and physical parts from different technologies that interact with each other. In this context, intelligent buildings (IBs) constitute a paradigm in which such smart systems are able to guarantee the comfort of residents while ensuring an appropriate tradeoff of energy production and consumption by means of an energy management system (EMS). These interconnected EMSs remain the objective of potential cyber-attacks, which is a major concern. Therefore, this paper conducts a survey, from a multidisciplinary point of view, of some of the main security and privacy issues related to IBs as part of the SG, including an overview of EMS, smart meters, and the main communication networks employed to connect IBs to the overall SG. Future research directions towards a security enhancement from both technical and human perspectives are also provided.", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables", "Sécurité, Cybersécurité, Résilience, Sureté, Fonctionnement et Interopérabilité des systèmes"]},
{"abstract":"The pavement deterioration can be caused by multiple factors such as traffic, weather conditions and structural characteristics. To maintain the quality of roads and extend their life while reducing maintenance costs, it is essential to predict and anticipate deterioration. The use of predictive maintenance, based on in-situ monitoring, statistical analysis and artificial intelligence, is therefore necessary. Nevertheless, its implementation must deal with several challenges such as managing large amounts of data collected from different sources or modelling in an uncertain environment. In this context, to improve road infrastructure monitoring, this study combines three scientific fields to demonstrate the feasibility of a digital twin of a pavement section. The proposed methodology is based on the optimization of road instrumentation tools, using wireless sensors, to feed mechanical and data-driven models to predict pavement damage and thus anticipate its health. This multidisciplinary approach is implemented on a case study: an instrumented highway section in the Bordeaux region in France.", "themes":["Communications, Infrastructures et Connectivité"]},
{"abstract":"Dielectric material ageing is one of the main issues which induces electrical machine failure. This ageing is most generally induced by thermal and electrical stresses, oxidation, or a combination of these different effects. Ultra-High Frequency (300 MHz-3 GHz) characterization may be a promising method for the insulation ageing assessment, by monitoring the evolution of the dielectric properties in this frequency band. This characterization can be performed using electromagnetic sensors. Therefore, the main topic of this study focuses on the relative permittivity evolution of epoxy resin samples exposed to thermo-oxidative stress measured by a microstrip ring resonator. The first step is to determine if the sensitivity of this sensor is sufficient to identify a change in the dielectric properties of the resin samples. In order to correlate these potential changes induced by ageing phenomena, Fouriertransform infrared spectroscopy and mass loss measurements are also performed. ", "themes":["Matériaux, Aérodynamique, Transition écologique, Énergétique et Mobilités durables"]},
{"abstract":"At a time when modes of consumption are rapidly evolving, consumer attitudesand expectations are changing.Today, customers want more and more products and services that can be customised to their needs. Furthermore, they are more willing to pay for usage of a product rather than ownership. On the other hand, companies are adding more and more services to the products they are bringing to market in order to create added value and differentiate themselves from their competitors.To adapt to these new market trends, companies now have to offer their customers a more sophisticated catalog of solutions, in both product and services, including all conceivable combinations of the two. The aim of this article is to propose a generic knowledge-based model, dedicated to commercial offer configuration which is able to cope with the whole variety of solutions a company can deliver. To our knowledge, although some works on product configuration, service and product-service system configuration exist, none of them is generic enough to support product, service and product-service configuration at the same time when defining commercial offers. In this article, after giving a state-of-the-art assessment of product and service configurations, the need for a generic model able to cover the whole range and diversity of ommercial offers is established, a knowledge-based model is defined and its relevance is demonstrated on seven use-cases coming from secondary and tertiary sector companies.", "themes":["Sciences économique, Évaluation des politiques publiques, Modèles économiques"]},
{"abstract":"In this paper, we present a method that supports multi-server learning with distributed data, by collecting selected data from the neighbors of training servers, the proposed training scheme can train multiple models on multiple servers located at specific points. By collecting selected data from the neighbors of the training servers, the proposed training scheme can train multiple models on multiple servers located at specific points, then we will create a method to share the learning tasks by exchanging the data on the shortest path between the servers.", "themes":["Base et Traitement de données, IA"]}
]

